package com.example.prayertime.ui.prayer

import com.example.prayertime.model.PrayerText

class Prayer {
    //     var tf:Typeface= Farsi.get
//    Typeface tf = Farsi.GetFarsiFont(this);
//    MyTextView.setTypeface(tf);
//    MyTextView.setText(Farsi.Convert("سلام"));
    fun getList(): List<PrayerText> {
        return listOf(
            PrayerText(
                1,
                1,
                "Тонг ва кечқурунда",
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким эрталаб ёки кечқурун:\n" +
                        " \n" +
                        "سُبْحَانَ اللهِ وَبِحَمْدِهِ\n" +
                        "\n" +
                        "«Субҳаналлоҳи ва биҳамдиҳи», (Аллоҳга ҳамд айтиш билан Уни айбу нуқсонлардан поклаб ёд этаман), деб юз марта айтса, қиёмат куни бирор киши ундан афзал бўлмайди. Фақат ана шу киши айтганидек ёки ундан ошириб айтсагина, бўлиши мумкин», дедилар. \n" +
                        "\n" +
                        "Имом Муслим ривоятлари.\n" +
                        "\n" +
                        "Абу Довуднинг ривоятларида:\n" +
                        "\n" +
                        "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ\n" +
                        "\n" +
                        "«Субҳаналлоҳил ъазийм ва биҳамдиҳи», деб келган.\n" +
                        "\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам қизларининг биридан ривоят қилинади. У зот қизларига тонг отганида:\n" +
                        "\n" +
                        "سُبْحَانَ اللهِ وَبِحَمْدِهِ لاَ قُوَّةَ إِلاَّ بِاللهِ مَا شَاءَ اللهُ كَانَ وَمَا لَمْ يَشَأْ لَمْ يَكُنْ، أَعْلَمُ أَنَّ اللهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، وَأَنَّ اللهَ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا\n" +
                        "\n" +
                        "«Субҳаналлоҳи ва биҳамдиҳи, ла қуввата илла биллаҳи маша`аллоҳу кана ва ма лам йаша` лам йакун. Аъламу анналлоҳа ъала кулли шай`ин қодийр. Ва анналлоҳа қод аҳато бикулли шай`ин ъилма», деб айтишни ўргатар эдилар. Чунки бу калималарни тонг отганида айтган киши кеч киргунича муҳофаза қилинади. Кеч кирганида айтса, тонг отгунича муҳофаза этилади.\n" +
                        "(Маъноси: Аллоҳга ҳамд айтиш билан Уни поклаб ёд этаман. Аллоҳдан бошқада  қувват йўқ. Аллоҳ хоҳлаган нарса бўлади. Хоҳламаган нарса бўлмайди. Биламанки, Аллоҳ ҳар бир нарсага қодирдир. Ва, албатта, Аллоҳ ҳар бир нарсани илми билан иҳота қилгандир.) \n" +
                        "\n" +
                        "Абу Довуд ривоятлари."
            ),
            PrayerText(
                2,
                1,
                "Жума тонгида",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким жума куни бомдод намозидан олдин:\n" +
                        "\n" +
                        "أسْتَغْفِرُ اللهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ\n" +
                        "\n" +
                        "«Астағфируллоҳаллазий ла илаҳа илла ҳувал ҳаййул қоййум ва атубу илайҳ», деб уч марта айтса, Аллоҳ таоло унинг гуноҳларини денгиз кўпигича бўлса ҳам, кечириб юборади», дедилар.\n" +
                        "(Маъноси: Ҳай ва қаййум сифатли Зотдан бошқа илоҳ йўқ ва Унга истиғфор айтаман, Унга тавба қиламан.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                3,
                1,
                "Ухлаш учун тўшакка ётганда",
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: \n" +
                        "«Киши тўшакка ётаётганида кўрпа ва изорини қоқиб ташласин. Чунки унинг орасида нима борлигини билмайди. Сўнг: \n" +
                        "\n" +
                        "بِاسْمِكَ رَبِّي وَضَعْتُ جَنْبِي وَبِكَ أَرْفَعُهُ إِنْ أَمْسَكْتَ نَفْسِي فَارْحَمْهَا وَإِنْ أرْسَلْتَهَا فَاحْفَظْهَا بِمَا تَحْفَظُ بِهِ عِبَادَكَ الصَّالِحِينَ\n" +
                        "\n" +
                        "«Бисмика роббий вазоъту жамбий ва бика арфаъуҳу, ин амсакта нафсий фарҳамҳа ва ин арсалтаҳа фаҳфазҳа бима таҳфазу биҳи ъибадакас солиҳийн», деб айтсин», дедилар.\n" +
                        "(Маъноси: Эй Раббим, Сенинг исминг билан ётдим ва Сенинг исминг билан тураман. Агар менинг руҳимни олсанг, унга раҳм қил. Агар уни қўйиб юборсанг, худди солиҳ бандаларингни сақлаганингдек, уни ҳам ҳифзу ҳимоянгга ол.)\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари.\n" +
                        "\n" +
                        "Оиша розияллоҳу анҳо айтадилар:\n" +
                        "«Расулуллоҳ соллаллоҳу алайҳи васаллам тўшакларига ётсалар, қўлларига суфлаб, иккита «Қул аъузу»ни ўқир, сўнг таналарига суртар эдилар».\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари."
            ),
            PrayerText(
                4,
                1,
                "Безовта бўлиб, ухлай олмаганда",
                "Зайд ибн Собит розияллоҳу анҳу айтадилар:\n" +
                        "«Расулуллоҳ соллаллоҳу алайҳи васалламга уйқусизликдан шикоят қилдим, у зот:\n" +
                        "\n" +
                        "اللهُمَّ غَارَتِ النُّجُومُ وَهَدَأَتِ العُيُونُ وَأَنْتَ حَيٌّ قَيُّوم لاَ تَأْخُذُكَ سِنَةٌ وَلاَ نَومٌ يَا حَيُّ يَا قَيُّومُ أهْدِي لَيْلِي وَأنِمْ عَيْنِي\n" +
                        "\n" +
                        "«Аллоҳумма ғоротин нужуму ва ҳада`атил ъуйуну ва анта ҳаййун қоййум, ла та`хузука синатун ва ла навм, йа ҳаййу, йа қоййуму, аҳдий лайлий ва аним ъайний, деб айт», дедилар. Шу дуони айтган эдим, Аллоҳ мендан уйқусизликни кетказди».\n" +
                        "(Маъноси: Аллоҳим, юлдузлар ботди, кўзлар тинди. Сен тирик, қоимдирсан. Сени мудроқ ҳам, уйқу ҳам олмайди. Эй Ҳай ва Қаййум сифатли Зот, кечамни тинч қилиб, кўзимга уйқу бер.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари"
            ),
            PrayerText(
                5,
                1,
                "Уйқуда қўрққанда",
                "Амр ибн Шуайб оталаридан, оталари боболаридан ривоят қиладилар.\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам уйқусида қўрққанларга:\n" +
                        "\n" +
                        "أعُوذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ غََضَبِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأنْ يَحْضُرُونِ\n" +
                        "\n" +
                        "«Аъузу бикалиматиллаҳит таммаҳ мин ғозабиҳи ва шарри ъибадиҳи ва мин ҳамазатиш шайатийни ва ан йаҳзуруни», деб айтишни ўргатганлар.\n" +
                        "(Маъноси: Аллоҳнинг мукаммал калималари билан Унинг ғазабидан, бандаларининг ёмонлигидан, шайтон ҳозир бўлиб, васваса қилишидан паноҳ тилайман.)\n" +
                        "\n" +
                        "Абу Довуд, Термизий ва Ибн Суннийлар ривоятлари."
            ),
            PrayerText(
                6,
                1,
                "Тушида ёқтирмаган нарсани кўрганда",
                "Ибн Суннийнинг ривоятларида Абу Ҳурайра розияллоҳу анҳу бундай деганлар:\n" +
                        "«Агар бирортангиз ўзи ёқтирмаган туш кўрса, уч марта туфлаб:\n" +
                        "\n" +
                        "إِنِّي أعُوذُ بِكَ مِنْ عَمَلِ الشَّيْطَانِ وَسَيِّئَاتِ الأَحْلاَمِ\n" +
                        "\n" +
                        "«Инний аъузу бика мин ъамалиш шайтони ва саййиатил аҳлами», деса, унга ҳеч нарса бўлмайди».\n" +
                        "(Маъноси: Мен шайтоннинг амалидан ва булғанган тушдан Сенинг исминг ила паноҳ тилайман.)\n"
            ),
            PrayerText(
                7,
                1,
                "Уйқудан уйғонганда",
                "Ҳузайфа ибн Ямон розияллоҳу анҳу ва Абу Зарр розияллоҳу анҳудан ривоят қилинади.\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам тўшакларига ётсалар, \n" +
                        "\n" +
                        "بِاسْمِكَ اللهمَّ أَحْيَا وَأَمُوتُ\n" +
                        "\n" +
                        "«Бисмикаллоҳумма аҳйа ва амуту», деб айтганлар.\n" +
                        "(Маъноси: Эй Раббим, Сенинг исминг билан тириламан ва ўламан.)\n" +
                        "Уйғонганларида: \n" +
                        "\n" +
                        "الْحَمْدُ للهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ\n" +
                        "\n" +
                        "«Алҳамду лиллаҳиллазий аҳйана баъда ма аматана ва илайҳин нушур», деб айтар эдилар.\n" +
                        "(Маъноси: Бизни ўлдиргандан кейин тирилтирган Аллоҳга ҳамд бўлсин. Ва биз Унгагина қайтамиз.)\n" +
                        "\n" +
                        "Имом Бухорий ривоятлари.\n"
            ),
            PrayerText(
                8,
                2,
                "Таҳорат қилганда",
                "Умар ибн Хаттоб розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким таҳорат қилиб бўлиб:\n" +
                        "\n" +
                        "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ الله وَحْدَهُ لاَ شَرِيكَ لَهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ\n" +
                        "\n" +
                        "«Ашҳаду анла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳу», деса, унга жаннатнинг саккизта эшиги очилиб, хоҳлаганидан кираверади», дедилар.\n" +
                        "\n" +
                        "Имом Муслим ривоятлари."
            ),
            PrayerText(
                9,
                2,
                "Масжидга кетаётганда",
                "Ибн Аббос розияллоҳу анҳудан ривоят қилинади:\n" +
                        "У зот холалари Маймуна розияллоҳу анҳунинг уйларида тунаб қолганларида, Расулуллоҳ соллаллоҳу алайҳи васалламнинг қуйидаги ишларига гувоҳ бўлганини айтадилар:\n" +
                        "«Набий соллаллоҳу алайҳи васаллам муаззиннинг бомдодга айтган азонини эшитдилар, сўнг намозга кетатуриб, қуйидаги дуони ўқидилар:\n" +
                        "\n" +
                        "اللهُمَّ اجْعِلْ فِي قَلْبِي نُورًا وَفِي لِسَانِي نُورًا وَاجْعَلْ فِي سَمْعِي نُورًا وَاجْعَلْ فِي بَصَرِي نُورًا وَاجْعَلْ مِنْ خَلْفِي نُورًا وَمِنْ أَمَامِي نُورًا وَاجْعَلْ مِنْ فَوقِي نُورًا وَمِنْ تَحْتِي نُورًا، اللهُمَّ اعْطِنِي نُورًا\n" +
                        "\n" +
                        "«Аллоҳуммажъал фий қолбий нурон ва фий лисаний нурон важъал фий самъий нурон важъал фий басорий нурон важъал мин холфий нурон ва мин амамий нурон важъал мин фавқий нурон ва мин таҳтий нурон, Аллоҳуммаътиний нуро».\n" +
                        "(Маъноси: Эй Раббим, қалбимда нур қил, тилимда нур қил, қулоғимда нур қил, кўзимда нур қил, орқамдан нур қил, олдимдан нур қил, устимдан нур қил, остимдан нур қил, эй Раббим, менга нур ато эт). \n" +
                        "\n" +
                        "Имом Муслим ривоятлари."
            ),
            PrayerText(
                10,
                2,
                "Масжидга кираётганда ва ундан чиқаётганда",
                "Абу Ҳумайд ёки Абу Усайдлардан ривоят қилинади:\n" +
                        "“Расулуллоҳ соллаллоҳу алайҳи васаллам айтдилар:\n" +
                        "«Агар бирортангиз масжидга кирса, Расулуллоҳ соллаллоҳу алайҳи васалламга салом айтиб, сўнг:\n" +
                        "\n" +
                        "اللهُمَّ افْتَحْ لِي أبْوَابَ رَحْمَتِكَ\n" +
                        "\n" +
                        "«Аллоҳуммафтаҳ лий абваба роҳматик», деб айтсин.\n" +
                        "(Маъноси: Эй Раббим, бизга раҳмат эшикларини очгин)\n" +
                        "\n" +
                        "Чиққанида эса:\n" +
                        "اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ\n" +
                        "\n" +
                        "«Аллоҳумма инний ас`алука мин фазлик», десин».\n" +
                        "(Маъноси: Эй Раббим, Сенинг фазлингни сўрайман.)\n" +
                        "Бу ҳадисни Имом Муслим ривоят қилганлар. Лекин у зотнинг ривоятларида «Расулуллоҳга салом айтсин», деган лафз йўқ."
            ),
            PrayerText(
                11,
                2,
                "Азон ва иқоматни эшитганда",
                "Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам:\n" +
                        "«Азонни эшитганингларда муаззин нима деса, ўшани айтинглар», дедилар.\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари.\n" +
                        "\n" +
                        "Азоннинг ҳаммасини эшитиб бўлганидан кейин Расулуллоҳга саловот айтиб, ортидан мана бу дуони ўқийди:\n" +
                        "Жобир розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: Ким азонни эшитган пайтида\n" +
                        "\n" +
                        "اللهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ وَالصَّلاَةِ القَائِمَةِ آتِ مُحَمَّدًا الوَسِيلَةَ وَالفَضِيلَةَ وَابْعَثْهُ مَقَامًا مُحْمُودًا الَّذِي وَعَدْتَهُ\n" +
                        "\n" +
                        "«Аллоҳумма робба ҳазиҳид даъватит таммаҳ вассолатил қоимаҳ, ати Муҳаммаданил васийлата вал фазийлаҳ вабъасҳу мақомам маҳмуданиллазий ваъадтаҳ», деб айтса, Қиёмат куни унга шафоат бўлади”, дедилар. \n" +
                        "(Маъноси: Эй бу комил дуонинг ва қоим бўлган намознинг эгаси - Аллоҳим, Муҳаммадга васила ва фазилат бер, у зотни ваъда қилганинг мақтовли мақомда тирилтир), деб сўнгра хоҳлаганича дунёвий ва ухровий дуоларни қилаверади.)\n" +
                        "\n" +
                        "Абу Довуд ривоятлари."
            ),
            PrayerText(
                12,
                2,
                "Намоз бошланганда",
                "Оиша онамиз розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам намозни бошласалар:\n" +
                        "\n" +
                        "سُبْحَانَكَ اللهُمَّ وَبِحَمْدِكَ وَتَبَارَكَ اسْمُكَ وَتَعَالى جَدُّكَ وَلاَ إِلَهَ غَيْرُكَ\n" +
                        "\n" +
                        "«Субҳанакаллоҳумма ва биҳамдика ва табарокасмука ва таъала жаддука ва ла илаҳа ғойрук», дер эдилар.\n" +
                        "(Маъноси: Эй Раббим, Сенга ҳамд айтиш билан Сени айбу нуқсонлардан поклайман. Сенинг исминг муборакдир. Азаматинг олийдир. Сендан бошқа илоҳ йўқдир.)"
            ),
            PrayerText(
                13,
                2,
                "Намоздаги рукуъда",
                "Намоз ўқиётган киши рукуъга тўла эгилса;\n" +
                        "\n" +
                        "سُبْحَانَ رَبِّيَ العَظِيمِ، سُبْحَانَ رَبِّيَ العَظِيمِ، سُبْحَانَ رَبِّيَ العَظِيمِ\n" +
                        "\n" +
                        "«Субҳана роббийал ъазийм», деб рукуъ зикрларини айтади.\n" +
                        "(Маъноси: Улуғ Раббим нуқсонлардан покдир.)"
            ),
            PrayerText(
                14,
                2,
                "Рукуъдан бош кўтарганда ва тик турганда",
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам рукуъдан қоматларини кўтарганларида:\n" +
                        "\n" +
                        "سَمِعَ اللهُ لِمَنْ حَمِدَهُ رَبَّنَا لَكَ الْحَمْدُ\n" +
                        "\n" +
                        "«Самиъаллоҳу лиман ҳамидаҳ» (Ким ҳамд айтса, Аллоҳ уни эшитади), тик бўлганларида эса, «Роббана лакал ҳамд» (Раббимиз, Сенга ҳамд бўлсин), деб айтар эдилар. \n" +
                        "(Баъзи ривоятларда: «Роббана ва лакал ҳамд» бўлиб келган). \n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари"
            ),
            PrayerText(
                15,
                3,
                "Сажда пайтида",
                "Расулуллоҳ алайҳиссалом: «Агар бирортангиз сажда қилса, камида уч марта:\n" +
                        "\n" +
                        "سُبْحَانَ رَبِّيَ الأَعْلَى، سُبْحَانَ رَبِّيَ الأَعْلَى، سُبْحَانَ رَبِّيَ الأَعْلَى\n" +
                        "\n" +
                        "«Субҳана роббийал аъла, Субҳана роббийал аъла, Субҳана роббийал аъла», деб айтсин», дедилар.\n" +
                        "\n" +
                        "Сунан китобларида ривоят қилинган."
            ),
            PrayerText(
                16,
                3,
                "Витр намозидаги қунут дуоси",
                "اللهُمَّ إِنَّا نَسْتَعِينُكَ وَنَسْتَغْفِرُكَ وَنُؤْمِنُ بِكَ وَنَتَوَكَّلُ عَلَيْكَ وَنُسْنِي عَلَيْكَ الْخَيْرَ كُلَّهُ نَشْكُرُكَ وَلاَ نَكْفُرُكَ وَنَخْلَعُ وَنَتْرُكُ مَنْ يَفْجُرُكَ، اللهُمَّ إِيَّاكَ نَعْبُدُ وَلَكَ نُصَلِّي وَنَسْجُدُ وَإِلَيْكَ نَسْعَي وَنَحْفِدُ نَرْجُو رَحْمَتَكَ وَنَخْشَى عَذَابَكَ إِنَّ عَذَابَكَ بِالكُفَّارِ مُلْحِقٌ\n" +
                        "\n" +
                        "Аллоҳумма инна настаъийнука ва настағфирука ва ну`мину бика ва натаваккалу ъалайка ва нусний ъалайкал хойро куллаҳ, нашкурука ва ла накфурука ва нахлаъу ва натруку май йафжурук. Аллоҳумма иййака наъбуду ва лака нусоллий ва насжуду ва илайка насъа ва наҳфиду наржу роҳматака ва нахша ъазабака инна ъазабака билкуффари мулҳиқ».\n" +
                        "(Маъноси: Эй Раббим, Сенинг ёрдам беришингни, ҳидоят қилишингни, гуноҳларни кечишингни сўрайман. Сенга тавба қилдим, иймон келтирдим ва Сенга суяндим. Яхшиликларнинг барчаси билан Сени сифатлаймиз. Сенга шукр қиламиз, ношукрлик қилмаймиз. Сенга фожирлик қилганлардан четлашамиз. Эй Раббим, Сенга ибодат, намоз, сажда этамиз. Ва Сенинг йўлингда саъй-ҳаракат қилиб, раҳматингни умид қиламиз. Азобингдан қўрқамиз. Албатта, ҳақ азобинг кофирларга рўпара қилинувчидир.)"
            ),
            PrayerText(
                17,
                3,
                "Ташаҳҳуд",
                "\n" +
                        "Ибн Масъуд розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам ташаҳҳудда:\n" +
                        "\n" +
                        "اَلتَّحِيَّاتُ للهِ وَالصَّلَوَاتُ وَالطَيِّبَاتُ السَّلاَمُ عَلَيْكَ أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللهِ وَبَرَكَاتُهُ السَّلاَمُ عَلَيْنَا وَعَلَى عِبَادِ اللهِ الصَّالِحِينَ، أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ\n" +
                        "\n" +
                        "«Аттаҳиййату лиллаҳи вассолавату ваттоййибат ассаламу ъалайка аййуҳан набиййу ва роҳматуллоҳи ва барокатуҳ. Ассаламу ъалайна ва ъала ъибадиллаҳис солиҳийн. Ашҳаду алла илаҳа иллаллоҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳ», деб айтдилар.\n" +
                        "(Маъноси: «Саломлар, дуолар ва яхшиликларнинг барчаси Аллоҳ учундир. Эй Пайғамбар, сизга салом ва Аллоҳнинг раҳматию баракоти бўлсин. Бизларга ва Аллоҳнинг солиҳ бандаларига ҳам салом бўлсин. Аллоҳдан бошқа илоҳ йўқ деб гувоҳлик бераман. Ва яна Муҳаммад Аллоҳнинг бандаси ва расули деб гувоҳлик бераман.)\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари."
            ),
            PrayerText(
                18,
                3,
                "Ташаҳҳуддан кейинги саловотлар",
                "للهُمَّ صَلِّ عَلَى مُحَمَّدٍ وعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ. اللهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.\n" +
                        "\n" +
                        "«Аллоҳумма солли ъала Муҳаммадин ва ъала али Муҳаммад, кама соллайта ъала Иброҳийма ва ъала али Иброҳийм, иннака ҳамийдум мажийд. Аллоҳумма барик ъала Муҳаммадин ва ъала али Муҳаммад, кама барокта ъала Иброҳийма ва ъала али Иброҳийм, иннака ҳамийдум мажийд».\n" +
                        "(Маъноси: Аллоҳим, Иброҳим алайҳиссаломни ва у зотнинг оилаларини яхшилик ва раҳматда қилганинг каби Муҳаммад алайҳиссаломни ва у зотнинг оилаларини ҳам яхшилик ва раҳматда қил. Албатта, Сен мақтовга лойиқ улуғ зотсан. Аллоҳим, Иброҳим алайҳиссаломни ва у зотнинг оилаларини баракотли қилганингдек, Муҳаммад алайҳиссаломни ва у зотнинг оилаларини ҳам баракотли қил. Албатта, Сен мақтовга лойиқ улуғ зотсан.)"
            ),
            PrayerText(
                19,
                3,
                "Намоз тугаганда",
                "Савбон розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам намозни тугатсалар, уч марта «Астағфируллоҳ», деб сўнгра:\n" +
                        "\n" +
                        "اللهُمَّ أَنْتَ السَّلاَمُ وَمِنْكَ السَّلاَمُ تَبَارَكْتَ يَا ذَا الْجَلاَلِ وَالإِكْرَامِ\n" +
                        "\n" +
                        "«Аллоҳумма антас салам ва минкас салам, табарокта йа зал жалали вал икром», деб айтар эдилар.\n" +
                        "(Маъноси: Эй Аллоҳим, Сен саломсан ва салом Сендандир. Эй улуғ ва ҳурматли зот, Сен баракотлисан.)\n" +
                        "\n" +
                        "Имом Муслим ривоятлари.\n" +
                        "\n" +
                        "* Муғийра ибн Шўъба розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам намоздан фориғ бўлсалар:\n" +
                        "\n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، اللهُمَّ لاَ مَانِعَ لِمَا أَعْطَيْتَ وَلاَ مُعْطِيَ لِمَا مَنَعْتَ وَلاَ يَنْفَعُ ذَا الْجَدِّ مِنْكَ الْجَدُّ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодир. Аллоҳумма ла маниъа лима аътойта ва ла муътийа лима манаъта ва ла йанфаъу зал жадди минкал жадд»ни ўқир эдилар.\n" +
                        "(Маъноси: «Аллоҳдан ўзга илоҳ йўқ, Унинг шериги ҳам йўқ. Мутлақ мулк Уники ва ҳамд ҳам Унгадир. У ҳар нарсага қодирдир. Эй Раббим, Сен берган нарсани манъ қилувчи йўқ. Ва Сен манъ қилган нарсани берувчи йўқ. Буюклик Сендандир, бошқанинг буюклиги фойда бермайди.)\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари.\n" +
                        "\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ алайҳиссалом:\n" +
                        "«Ким ҳар бир намоз сўнгида ўттиз уч мартадан «субҳаналлоҳ, алҳамдулиллаҳ, Аллоҳу акбар», деб юзинчисини\n" +
                        "\n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳ, лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодийр», деб айтса, гуноҳлари денгиз кўпигича бўлса ҳам, кечирилади», дедилар.\n" +
                        "\n" +
                        "Имом Муслим ривоятлари.\n" +
                        "\n" +
                        "* Муоз розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам менинг қўлларимдан ушлаб: «Эй Муоз, Аллоҳга қасамки, мен сени яхши кўраман ва сенга ҳар намоз сўнгида \n" +
                        "\n" +
                        "اللهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ\n" +
                        "\n" +
                        "«Аллоҳумма аъинний ъала зикрика ва шукрика ва ҳусни ъибадатик»ни айтишни тавсия қиламан», дедилар».\n" +
                        "(Маъноси: Эй Аллоҳим, Сени зикр этишда, Сенга шукр қилишда ва ибодатингни гўзал бажаришда менга ёрдам бер.)\n" +
                        "\n" +
                        "Абу Довуд ва Насаий ривоятлари.\n" +
                        "\n" +
                        "* Абу Бакра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам намоз сўнгида:\n" +
                        "\n" +
                        "اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الكُفْرِ وَالفَقْرِ وَعَذَابِ القَبْرِ\n" +
                        "\n" +
                        "«Аллоҳумма инний аъузу бика минал куфри вал фақри ва ъазабил қобр», деб айтар эдилар.\n" +
                        "(Маъноси: Аллоҳим, куфрдан, камбағалликдан ва қабр азобидан Сендан паноҳ тилайман.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                20,
                3,
                "Қуръон хатм қилинганда",
                "اللهُمَّ ارْحَمْنِي بِالْقُرْءَانِ وَاجْعَلْهُ لِي إمَامًا وَنُورًا وَهُدًى وَرَحْمَةً، اللهُمَّ ذَكِّرْنِي مِنْهُمَا نَسِيْتُ وَعَلِّمْنِي مِنْهُمَا جَهِلْتُ وَارْزُقْنِي تِلاَوَتَهُ آنَاءَ اللَّيْلِ وَأطْرَافَ النَّهَارِ وَاجْعَلْهُ لِي حُجَّةً يَا رَبَّ العَالَمِينَ. اَللَّهُمَّ أَصْلِحْ لِي دِيْنِي الَّذِي هُوَ عِصْمَةُ أَمْرِي، وَأَصْلِحْ لِي دُنْيَاىَ الَّتِي فِيْهَا مَعَاشِي، وَأَصْلِحْ لِي آخِرَتِي الَّتِي فِيْهَا مَعَادِي، وَاجْعَلِ الْحَيَاةَ زِيَادَةً لِي فِي كُلِّ خَيْرٍ وَاجْعَلِ الْمَوتَ رَاحَةً لِي مِنْ كُلِّ شَرٍّ. \n" +
                        "اللهُمَّ اجْعَلْ خَيْرَ عُمْرِي آخِرَهُ وَخَيْرَ عَمَلِي خَوَاتِمَهُ وَخَيْرَ أيَّامِي يَومَ ألْقَاكَ فِيهِ. اللهُمَّ إنِّي أَسْألُكَ عِيْشَةً هَنِيَّةً وَمِيتَةً سَوِيَّةً وَمَرَدًّا غَيْرَ مُخْزٍى وَلاَ فَاضِحٍ. اللهُمَّ إنِّي أسْأَلُكَ خَيْرَ الْمَسْألَةِ وَخَيْرَ الدُّعَاءِ وَخَيْرَ النَّجَاحِ وَخَيْرَ العِلْمِ وَخَيْرَ العَمَلِ وَخَيْرَ الثَّوَابِ وَخَيرَ الْحَيَاةِ وَخَيْرَ الْمَمَاتِ وَثَبِّتْنِي وَثَقِّلْ مَوَازِينِي وَحَقِّقْ إيْمَانِي وَارْفَعْ دَرَجَتِي وَتَقَبَّلْ صَلاَتِي وَاغْفِرْ خَطِيئاتِي وَأسْأَلُكَ العُلاَ مِنَ الْجَنَّةِ. اللَّهُمَّ إِنَّي أسْأَلُكَ مُوْجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ وَالغَنِيْمَةَ مِنْ كُلِّ بِرٍّ وَالفَوزَ بِالْجَنَّةِ وَالنَّجَاةَ مِنَ النَّارِ. \n" +
                        "اللهُمَّ أحْسِنْ عَاقِبَتَنَا فِي الأُمُورِ كُلِّهَا وَأجِرْنَا مِنْ خِزْيِ الدُّنْيَا وَعَذَابِ الآخِرَةِ. \n" +
                        "اللهُمَّ اقْسِمْ لَنَا مِنْ خَشْيَتِكَ مَا يَحُولُ بَيْنَنَا وَبَيْنَ مَعَاصِيْكَ وَمِنْ طَاعَتِكَ مَا تُبَلِّغُنَا بِهِ جَنَّتَكَ وَمِنَ اليَقِيْنِ مَا تُهَوِّنُ بِهِ عَلَيْنَا مَصَائِبَ الدُّنْيَا. اللهُمَّ مَتِّعْنَا بِأَسْمَاعِنَا وَأَبْصَارِنَا وَقُوَّتِنَا مَا أَحْيَيْتَنَا وَاجْعَلْهُ الوَارِثَ مِنَّا وَاجْعَلْ ثَأْرَنَا عَلَى مَنْ ظَلَمَنَا وَانْصُرْنَا عَلَى مَنْ عَادَانَا وَلاَ تَجْعَلْ مُصِيْبَتَنَا فِي دِيْنِنَا وَلاَ تَجْعَلِ الدُّنْيَا أَكْبَرَ هَمِّنَا وَلاَ مَبْلَغَ عِلْمِنَا وَلاَ تُسَلِّطْ عَلَيْنَا مَنْ لاَ يَرْحَمُنَا. اللهُمَّ لاَ تَدَعْ لَنَا ذَنْبًا إلاَّ غَفَرْتَهُ وَلاَ هَمًّا إلاَّ فَرَّجْتَهُ وَلاَ دَيْنًا إلاَّ قَضَيْتَهُ وَلاَ حَاجَةً مِنْ حَوَائِجِ الدُّنْيَا وَالآخِرَةِ إلاَّ قَضَيْتَهَا يَا أرْحَمَ الرَّاحِمِينَ.\n" +
                        "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ، وَصَلَّى اللهُ عَلَى نَبِيِّنَا مُحَمَّدٍ وَعَلَى آلِهِ وَأصْحَابِهِ الأَخْيَارِ وَسَلَّمَ تَسْلِيمًا كَثِيرًا.\n" +
                        "\n" +
                        "Аллоҳумма ирҳамний билқуръани, важъалҳу лий имамав ва нурон ва ҳудан ва роҳматан. Аллоҳумма заккирний минҳу маа насийту ва ъаллимний минҳу маа жаҳилту, варзуқний тилаватаҳу аана аллайли ва атрофан наҳар важъалҳу лий ҳужжатан йа роббал оламийн. \n" +
                        "Аллоҳумма аслиҳ лий диний аллазий ҳува ъисмату амрий ва аслиҳ лий дуняйаллатий фийҳа маъаший ва аслиҳ лий охиратиллатий фийҳа маъадий, важъалил ҳаёта зиядатан фий кулли хойрин, важъалил мавта роҳатан лий мин кулли шаррин. \n" +
                        "Аллоҳумма ижъал хойро умрий охираҳу ва хойра ъамалий хавотимаҳу ва хойра айёмий явма алқока фийҳи. \n" +
                        "Аллоҳумма инний ас‘алука ъийшатан ҳаниййатан ва мийтатан савиййатан ва мараддан ғойра мухзин вала фазиҳин. \n" +
                        "Аллоҳумма инний ас‘алука хойрал мас‘алати ва хойрад дуо‘и ва хойран нажаҳи ва хойрал ъилми ва хойрал ъамали ва хойрас савоби ва хойрал ҳаёти ва хойрал мамати ва саббитний ва саққил мавазийний ва ҳаққиқ ийманий варфаъ дарожатий ва тақоббал солатий, вағфир хатий‘атий ва ас‘алукал ъуло минал жаннати. \n" +
                        "Аллоҳумма инний ас‘алука мувжибати роҳматика ва ъазоима мағфиротика вассаламата мин кулли исмин, валғониймата мин кулли биррин, валфавза билжаннати, ван нажата минан нар.\n" +
                        "Аллоҳумма аҳсин оқибатана фил умури куллиҳа ва ажирна мин хизйид дуня ва ъазабил охира.\n" +
                        "Аллоҳумма ақсим лана мин хошятика ма яҳулу байнана ва байна маъсиятика ва мин тоъатика ма тубаллиғуна биҳа жаннатака ва минал яқийни ма туҳаввину биҳи ъалайна масо‘ибаддунё. \n" +
                        "Аллоҳумма маттиъна би‘асмаъина ва абсорина ва қувватина ма аҳяйтана важъалҳул вориса мина, важъал са‘рона ъала ман золамана вансурна ъала ман ъадана, вала тажъал мусийбатана фий дийнина, вала тажъалид дуня акбара ҳаммина вала маблаға ъилмина, вала тусаллит ъалайна ман ла ярҳамуна». \n" +
                        "Аллоҳумма ла тадаъ лий занбан илла ғофартаҳу вала ҳамман илла фарражтаҳу вала дайнан илла қозайтаҳу вала ҳажатан мин ҳаваижид дуня вал охира илла қозайтаҳа йа арҳамар роҳимийн. \n" +
                        "Роббана аатина фиддуня ҳасанатан, вафил охирати ҳасанатан, вақина ъазабан нар. Васаллаллоҳу ъала набиййина Муҳаммадин ваъала олиҳи ва асҳабиҳил ахйари васаллама таслийман касийро. \n" +
                        "(Маъноси: «Аллоҳим, Қуръон сабабли бизга раҳм айлагин. Ва уни бизга йўлбошчи, нур, ҳидоят ва раҳмат қил. Аллоҳим унутган нарсаларимни менга эслат, жоҳиллик билан қилган хатоларимни менга билдир, кеча-ю кундузи уни тиловат қилиш ила мени ризқлантир. Эй оламлар Рабби! Уни менинг фойдамга ҳужжат қил. Аллоҳим, ишларимни сақловчи динимни ислоҳ эт. Яшайдиганим дунёимни ислоҳ қил. Қайтишим унга бўлган охиратимни ислоҳ айла. Ҳар бир яхшиликда ҳаётимни зиёда қил. Ва ҳар бир ёмонликда ўлимни роҳат қил.\n" +
                        "Аллоҳим, ҳаётимни энг яхшисини умрим охирида қил, амалимни энг яхшисини хотимада қил ва кунларимнинг энг яхшисини Сенга йўлиқадиган кунда қил.\n" +
                        "Аллоҳим, Сендан сўрашни яхшисини, яхши дуони, яхши муваффақиятни, яхши илмни, яхши амални, яхши савобни, яхши ҳаётни, яхши ўлимни сўрайман. Мени собитқадам қил, тарозумни оғир қил, иймонимни мустаҳкам қил, даражамни олий қил, намозимни қабул қил, хатоларимни кечир. Аллоҳим Сендан жаннатдаги олий мақомни сўрайман. Аллоҳим, раҳматингга мустаҳиқ бўладиган нарсани, мағфиратингни вожиб қиладиган нарсани, ҳар бир гуноҳдан саломат бўлишни ва ҳар бир яхшиликда ғаниматни ҳамда жаннат билан зафар қозонишни ва ёрдаминг билан дўзахдан нажот топишни сўрайман.\n" +
                        "Аллоҳим, барча ишларда оқибатимизни хайрли қил ҳамда дунё хорлигидан ва охират азобидан бизга паноҳ бер. Аллоҳим, Сенга қилинадиган гуноҳ ила бизнинг орамизни тўсадиган қўрқувни ва жаннатингга етказадиган тоатингни ҳамда дунё мусибатларини бизга енгиллаштирадиган яқийнни улуш қилиб бер. Аллоҳим, бизни тириклигимизда қулоғимиз, кўзимиз ва қувватимиз ила нафлантириб, уни бизга меросхўр қил (яъни, вафот этгунимизча омонда қил). Ўчимизни бизга зулм қилганларга қарат! Душманларимиз зиёнига бизга нусрат бер. Мусибатимизни динимизда қилма. Дунёни энг катта ғамимиз ва охирги илмимиз қилма. Ва бизга раҳм қилмайдиганларни бизга бошлиқ этма.\n" +
                        "Аллоҳим, бирор гуноҳ қолдирмасдан уни кечир, бирор ғам қолдирмасдан уни очиб юбор ва эй раҳм қилувчиларни раҳмлиси, бирор дунё ҳамда охират ҳожатларини қолдирмасдан уни рўёбга чиқар. Эй Раббимиз, бизга дунё ва охиратдаги яхшиликларни бер ва бизни дўзах азобидан сақла.\n" +
                        "Набиййимиз Муҳаммад алайҳиссаломга, оилаларига ва яхши деб ном чиқарган саҳобаларига кўпдан-кўп салавоту-саломлар бўлсин."
            ),
            PrayerText(
                21,
                3,
                "Ҳамма дуоларни ўзида жамлаган зикр",
                "Абу Умома розияллоҳу анҳудан ривоят қилинади:\n" +
                        "“Расулуллоҳ соллаллоҳу алайҳи васаллам жуда кўп дуолар билан илтижо қилардилар-у, биз ундан бирортасини ёдлаб қола олмас эдик. Шунда мен: «Эй Расулуллоҳ, кўп дуолар билан илтижо қиласиз-у биз ундан бирортасини ёдламаймиз», десам, у зот: «Ана шу дуоларнинг барчасини ўзида жамлаганига далолат қилайми? У:\n" +
                        "\n" +
                        "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْر مَا سَأَلَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَنَعُوذُ بِكَ مِنْ شَرِّ مَا اسْتَعَاذَكَ مِنْهُ نَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، وَأَنْتَ الْمُسْتَعَانُ وَعَلَيْكَ البَلاَغُ، وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ.\n" +
                        "\n" +
                        "«Аллоҳумма инний асъалука мин хойри ма са‘алака минҳу набиййука Муҳаммадун соллаллоҳу алайҳи васаллам ва наъузу бика мин шарри мастаъозака минҳу набиййука Муҳаммадун соллаллоҳу алайҳи васаллам ва антал мустаъону ва ъалайкал балағу вала ҳавла вала қуввата илла биллаҳ»дир, дедилар. \n" +
                        "(Маъноси: Аллоҳим, набиййинг Муҳаммад алайҳиссалом сўраган нарсаларнинг яхшисини Сендан сўрайман. Ва набиййинг Муҳаммад алайҳиссалом паноҳ сўраган нарсаларнинг ёмонидан паноҳ сўрайман. Ва Сен ёрдам сўралувчи зотсан. Етуклик Сенгадир. Аллоҳдан бошқа ўзгартирувчи ва қувват йўқдир.)\n" +
                        "\n" +
                        "Имом Термизий ривоятлари."
            ),
            PrayerText(
                22,
                4,
                "Истиғфорларнинг саййиди",
                "Шаддод ибн Авс розияллоҳу анҳудан ривоят қилинади:\n" +
                        "“Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким саййидул истиғфор –\n" +
                        " \n" +
                        "اللَّهُمَّ أَنْتَ رَبِّي لاَ إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ\n" +
                        "\n" +
                        "«Аллоҳумма анта роббий ла илаҳа илла анта холақтаний ва ана ъабдука ва ана ъала ъаҳдика ва ваъдика мастатоъту аъузу бика мин шарри ма сонаъту, абу‘у лака биниъматика ъалаййа ва абу‘у бизамбий фағфирлий фаиннаҳу ла йағфируз зунуба илла анта»ни кечки пайт айтиб, шу куни вафот этса, жаннатга киради. Ким тонгда айтиб, шу куни вафот этса, унда ҳам жаннатга киради», дедилар.\n" +
                        "(Маъноси: Аллоҳим, Сен Парвардигоримсан, Сендан бошқа илоҳ йўқ. Мени халқ қилдинг ва мен Сенинг қулингман. Мен Сенга берган ваъдамда ва Сенга берган аҳдимда қодир бўлганимча турибман. Қилган нарсаларимнинг ёмонидан Сенинг номинг билан паноҳ тилайман. Менга ато қилган неъматларингга иқрор бўлдим. Ва яна гуноҳларимга ҳам иқрор бўлдим. Менинг гуноҳларимни кечир. Чунки Сендан бошқаси гуноҳларимни кечира олмайди.)\n" +
                        "\n" +
                        "Имом Бухорий ривоятлари."
            ),
            PrayerText(
                23,
                4,
                "Истиғфор",
                "\n" +
                        "Ибн Масъуд розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки:\n" +
                        " \n" +
                        "أَسْتَغْفِرُ اللهَ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ القَيُّومُ وَأَتُوبُ إِلَيْهِ\n" +
                        "\n" +
                        "«Астағфируллоҳаллазий ла илаҳа илла ҳувал ҳаййул қаййум ва атубу илайҳи», деб айтса, (Аллоҳ ҳатто) урушдан қочгандаги гуноҳини ҳам кечириб юборади», дедилар. \n" +
                        "(Маъноси: Барҳаёт, тирик Аллоҳдан авф этишини сўрайман ва Унга тавба қиламан.) \n" +
                        "\n" +
                        "Абу Довуд ва Термизий ривоятлари.\n" +
                        "\n" +
                        "Жобир ибн Абдуллоҳ розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Бир киши Расулуллоҳ соллаллоҳу алайҳи васаллам ҳузурларига келиб, «Вой гуноҳларим, вой гуноҳларим», деб икки ёки уч марта айтди. Расулуллоҳ соллаллоҳу алайҳи васаллам унга:\n" +
                        "\n" +
                        "اللَّهُمَّ مَغْفِرَتُكَ أَوْسَعُ مِنْ ذُنُوبِي وَرَحْمَتُكَ أَرْجَى عِنْدِي مِنْ عَمَلِي\n" +
                        "\n" +
                        "«Аллоҳумма мағфиратука авсаъу мин зунубий ва роҳматука аржа ъиндий мин ъамалий», деб айт», дедилар. У бу дуони ўқиди. Сўнгра Расулуллоҳ соллаллоҳу алайҳи васаллам такрорла, дедилар. Бас, у такрорлади. Сўнгра яна такрорла, дедилар. У яна такрорлади. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Тур, батаҳқиқ мағфират қилиндинг», дедилар. \n" +
                        "(Маъноси: Аллоҳим, мағфиратинг гуноҳимдан кенгроқдир. Раҳматинг ҳузуримдаги амалимдан умидлироқдир.)\n" +
                        "\n" +
                        "Имом Ҳоким ривоятлари.\n" +
                        "\n" +
                        "Абу Умома розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Албатта\n" +
                        "\n" +
                        "يَا أَرْحَمَ الرَّاحِمِيْنَ\n" +
                        "\n" +
                        "«Йа арҳамар роҳимийн» («Эй раҳм қилувчиларнинг раҳмлиси»), деб айтадиган кишиларга Аллоҳ таолонинг вакил қилинган фаришталари бордир. Кимки буни уч марта айтса, фаришталар у учун «Раҳм қилувчиларнинг раҳмлиси (Аллоҳ), Сенга юзланди, бас, Сен ундан сўрагин, дейишади».\n" +
                        "\n" +
                        "Имом Ҳоким ривоятлари."
            ),
            PrayerText(
                24,
                4,
                "Икки ҳайит намозида айтиладиган такбир",
                "\n" +
                        "اللهُ أَكْبَرُ اللهُ أَكْبَرُ اللهُ أَكْبَرُ لاَ إِلَهَ إِلاَّ اللهُ وَاللهُ أَكْبَرُ اللهُ أَكْبَرُ وَللهِ الْحَمْدُ\n" +
                        "\n" +
                        "«Аллоҳу акбар Аллоҳу акбар, Аллоҳу акбар, ла илаҳа иллаллоҳу валлоҳу акбар, Аллоҳу акбар ва лиллаҳил ҳамд».\n" +
                        "(Маъноси: Аллоҳ улуғдир, Аллоҳ улуғдир, Аллоҳ улуғдир. Аллоҳдан бошқа илоҳ йўқ. Аллоҳ улуғдир, Аллоҳ улуғдир. Аллоҳга ҳамд бўлсин.)"
            ),
            PrayerText(
                25,
                4,
                "Кийим кийишда",
                "Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам кўйлак, ридо ёки салла кийсалар, бисмиллоҳни айтиб, сўнг: \n" +
                        "\n" +
                        "اللهمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِهِ وَخَيْرِ مَا هُوَ لَهُ وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا هُوَ لَهُ\n" +
                        "\n" +
                        "«Аллоҳумма инний ас`алука мин хойриҳи ва хойри ма ҳува лаҳу ва аъузу бика мин шарриҳи ва шарри ма ҳува лаҳу», деб ўқир эдилар.\n" +
                        "(Маъноси: Эй Раббим, Сендан унинг яхшисини ва унга бериладиган нарсанинг яхшисини сўрайман. Ва унинг ёмонидан ҳамда унга бериладиган нарсанинг ёмонидан паноҳ тилайман.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                26,
                4,
                "Янги кийим кийганда",
                "Абу Саид Худрий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам янги кийим кийсалар, саллами, кўйлакми ёки ридоми, бисмиллоҳни айтиб, сўнг қуйидаги дуони ўқир эдилар:\n" +
                        "\n" +
                        "اللهُمَّ لَكَ الْحَمْدُ أَنْتَ كَسَوْتَنِيهِ، أَسْأَلُكَ خَيْرَهُ وَخَيْرَ مَا صُنِعَ لَهُ وَأَعُوذُ بِكَ مِنْ شَرِّهِ وَشَرِّ مَا صُنِعَ لَهُ\n" +
                        "\n" +
                        "«Аллоҳумма лакал ҳамду анта касавтанийҳи, ас`алука хойраҳу ва хойра ма суниъа лаҳу ва аъузу бика мин шарриҳи ва шарри ма суниъа лаҳу».\n" +
                        "(Маъноси: Эй Раббим, мени кийинтирганинг учун Сенга ҳамд бўлсин. Сендан бунинг яхшилигини ва унга қилинган яхшиликни сўрайман. Ва бунинг ёмонлигидан ва унга қилинган ёмонликдан паноҳ тилайман.)\n" +
                        "\n" +
                        "Абу Довуд, Термизий ва Насаий ривоятлари."
            ),
            PrayerText(
                27,
                4,
                "Кийим ечилганда",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Мусулмон киши кийимини ечмоқчи бўлса:\n" +
                        "\n" +
                        "بِسْمِ اللهِ الَّذِي لاَ إِلَهَ إِلاَّ هُوَ\n" +
                        "\n" +
                        "«Бисмиллаҳиллазий ла илаҳа илла ҳува», деб айтсин, шу сўз одам боласи аврати билан жин кўзи орасида пардадир», дедилар.\n" +
                        "(Маъноси: Ундан бошқа илоҳ йўқ бўлган Аллоҳнинг исми билан.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                28,
                4,
                "Уйдан чиқаётганда",
                "Умму Салама онамиз розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам уйдан чиқаётиб:\n" +
                        "\n" +
                        "بِاسْمِ اللهِ تَوَكَّلْتُ عَلَى اللهِ، اللهُمَّ إِنِّي أَعُوذُ بِكَ أَنْ أَضِلَّ أَوْ أُضَلَّ أَوْ أَزِلَّ أَوْ أُزَلَّ أَوْ أَظْلِمَ أَوْ أُظْلَمَ أَوْ أَجْهَلَ أَوْ يُجْهَلَ عَلَيَّ\n" +
                        "\n" +
                        "«Бисмиллаҳи, таваккалту ъалаллоҳи. Аллоҳумма инний аъузу бика ан адилла ав удалла ав азилла ав узалла ав азлима ав узлама ав ажҳала ав йужҳала ъалаййа», деган дуони ўқир эдилар».\n" +
                        "(Маъноси: Аллоҳ номи билан. Аллоҳга таваккал қилдим. Эй Раббим, адашиш ва адаштирилишдан, тойилиш ва тойилтирилишдан, зулм қилиш ва зулм кўришдан, жоҳиллик қилиш ва менга нисбатан жоҳиллик қилинишидан Сендан паноҳ сўрайман.)\n" +
                        "\n" +
                        "Абу Довуд, Термизий, Насаий, Ибн Можа ривоятлари."
            ),
            PrayerText(
                29,
                5,
                "Уйга кираётганда",
                "Манзилга кираётганда «Бисмиллоҳ»ни айтиб, зикрни кўпайтириб, уйда одам бўлсин-бўлмасин, салом бериб кириш мустаҳабдир. Аллоҳ таоло Нур сурасининг 61-оятида: «Бас, қачон уйларга кирсангизлар, бир-бирларингизга Аллоҳ ҳузуридан бўлган муборак покиза саломни айтинглар (яъни, ассалому алайкум, денглар)», деб буюради.\n" +
                        "\n" +
                        "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам менга: «Эй ўғилчам, уйингга кирсанг, салом бериб кир. Бу ишинг ўзингга ва аҳли аёлингга барака келтиради», дедилар».\n" +
                        "\n" +
                        "Имом Термизий ривоятлари.\n" +
                        "\n" +
                        "Абу Молик Ашъарий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Киши уйига кираётганида:\n" +
                        "\n" +
                        "اللهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ الْمَوْلَجِ وَخَيْرَ الْمَخْرَجِ، بِاسْمِ اللهِ وَلَجْنَا وَبِاسْمِ اللهِ خَرَجْنَا وَعَلَى اللهِ رَبِّنَا تَوَكَّلْنَا\n" +
                        "\n" +
                        "«Аллоҳумма инний ас`алука хойрал мавлажи ва хойрал махражи, бисмиллаҳи валажна ва бисмиллаҳи хорожна ва ъалаллоҳи роббина таваккална».\n" +
                        "(Маъноси: Эй Раббим, Сендан киришнинг ҳам, чиқишнинг ҳам яхшисини сўрайман. Аллоҳнинг исми билан кирдик. Аллоҳнинг исми билан чиқдик. Раббимиз Аллоҳга таваккал қилдик), деб айтиб, сўнгра аҳлига салом берсин», дедилар. \n" +
                        "\n" +
                        "Абу Довуд ривоятлари."
            ),
            PrayerText(
                30,
                5,
                "Ҳожатхонага кираётганда",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам ҳожатхонага кираётганларида:\n" +
                        "\n" +
                        "اللهُمَّ إِنَّي أَعُوذُ بِكَ مِنَ الْخُبْثِ وَالْخَبَائِثِ\n" +
                        "\n" +
                        "«Аллоҳумма инний аъузу бика минал хубси вал хобаис» дуосини ўқир эдилар».\n" +
                        "(Маъноси: Эй Раббим, эркак ва аёл шайтоннинг ёмонлигидан паноҳ тилайман.)\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари."
            ),
            PrayerText(
                31,
                5,
                "Ҳожатхонадан чиқаётганда",
                "Расулуллоҳ соллаллоҳу алайҳи васаллам ҳожатхонадан чиққанларида:\n" +
                        "\n" +
                        "غُفْرَانَكَ، الْحَمْدُ للهِ الَّذِي أَذْهَبَ عَنِّي الأَذَى وَعَافَانِي\n" +
                        "\n" +
                        "«ғуфронака» (Сенинг мағфиратингни сўрайман) ва «алҳамду лиллаҳиллазий азҳаба ъаннил аза ва ъафаний» (мендан азиятларни кетказиб, офиятда қилган Аллоҳга ҳамд бўлсин), деб айтар эдилар.\n" +
                        "\n" +
                        "Аввалгисини Абу Довуд ва Термизий, кейингисини Насаий ва Ибн Можалар ривоят қилишган.\n"
            ),
            PrayerText(
                32,
                5,
                "Ейиш ва ичиш пайтида",
                "Хавла бинти Ҳаким розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки бир манзилга тушиб;\n" +
                        " \n" +
                        "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ\n" +
                        "\n" +
                        "«Аъузу бикалиматиллаҳит таммати мин шарри ма холақ», деб айтса, то бошқа манзилга кўчгунича бирор нарса зарар етказа олмайди», деб айтдилар.\n" +
                        "(Маъноси: «Аллоҳимнинг ҳамма калималари билан У яратган нарсаларнинг ёмонлигидан паноҳ тилайман».)\n" +
                        "\n" +
                        "Имом Муслим, Молик ва Термизийлар ривояти.\n" +
                        "\n" +
                        "Абдуллоҳ ибн Умар ибн Хаттоб розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам агар сафар қилсалар, ана шу куни кечаси\n" +
                        "\n" +
                        " يَا أَرْضُ رَبِّي وَرَبُّكِ اللهُ، أَعُوذُ بِاللهِ مِنْ شَرِّكِ وَشَرِّ مَا فِيْكِ، وَشَرِّ مَا خُلِقَ فِيْكِ، وَشَرِّ مَا يَدِبُّ عَلَيْكِ؛ أَعُوذُ بِكَ مِنْ أَسَدٍ وَأَسْوَدَ، وَمِنَ الْحَيَّةِ وَالعَقْرَبِ، وَمِنْ سَاكِنِ البَلَدِ وَمِنْ وَالِدٍ وَمَا وَلَدَ\n" +
                        "\n" +
                        "«Йа арзу роббий ва роббукиллаҳу, аъузу биллаҳи мин шаррики ва шарри ма фийки, ва шарри ма хулиқо фийки, ва шарри ма йадиббу ъалайки, Аъузу бика мин асадин ва асвада ва минал ҳаййати вал ъақраби ва мин сакинил балади ва мин волидин вама валада», деб айтардилар. \n" +
                        "(Маъноси: «Эй ер, менинг ва сенинг Раббинг Аллоҳдир. Аллоҳнинг номи билан сенинг ёмонлигингдан, сендаги ёмонликдан, сенда халқ қилинган ёмонликдан, сенда судралиб юрадиганларнинг ёмонлигидан паноҳ тилайман. Ва яна шердан, кишилардан, илондан, чаёндан, ерда яшовчи жинлардан, иблис ҳамда шайтондан паноҳ тилайман».)\n" +
                        "\n" +
                        "Абу Довуд ривоятлари."
            ),
            PrayerText(
                33,
                5,
                "Овқат еб бўлганда",
                "Абу Саид ал-Худрий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам агар овқат еб бўлсалар, \n" +
                        "\n" +
                        "الْحَمْدُ للهِ الَّذِي أَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِيْنَ\n" +
                        "\n" +
                        "«Алҳамду лиллаҳил лазий атъамана ва сақона ва жаъалана муслимийн», деб айтардилар. \n" +
                        "(Маъноси: «Бизларни овқатлантириб, бизларни суғориб ҳамда бизларни мусулмон қилиб қўйган Аллоҳга ҳамд бўлсин».)\n" +
                        "\n" +
                        "Абу Довуд ва Термизий ривояти."
            ),


            PrayerText(
                34,
                5,
                "Совчи бўлиб борганда",
                "\n" +
                        "Совчи бўлиб келувчи киши Аллоҳга ҳамду сано, Расулуллоҳ соллаллоҳу алайҳи васалламга салавот айтиб, сўнгра\n" +
                        "\n" +
                        "أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُلُهُ\n" +
                        "\n" +
                        "«Ашҳаду анла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу ва ашҳаду анна Муҳаммадан ъабдуҳу ва росулуҳу», деб сизларнинг қизингизга рағбат қилган ҳолда ёки фалончи қизи фалончини сўраб келдик, деб айтади."
            ),
            PrayerText(
                35,
                5,
                "Никоҳ битими тузилганда",
                "\n" +
                        "بَارَكَ اللهُ عَلَيْكَ وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ\n" +
                        "\n" +
                        "«Барокаллоҳу алайка ва жамаъа байнакума фий хойрин»\n" +
                        "(Маъноси: «Аллоҳ сенга барака берсин» ёки «Ораларингизни яхшиликда жамласин»), деб айтиш суннат амалдир."
            ),
            PrayerText(
                36,
                6,
                "Никоҳ кечасида",
                "Аёлига илк бор йўлиққанда, унинг пешонасига қўлни қўйиб, \n" +
                        "\n" +
                        "بَارَكَ اللهُ لِكُلِّ وَاحِدٍ مِنَّا فِي صَاحِبِهِ\n" +
                        "\n" +
                        "«Барокаллоҳу ликулли ваҳидим минна фий соҳибиҳи»\n" +
                        "(Маъноси: «Аллоҳ ҳар биримизни ўз жуфтига баракали қилсин»), деб айтмоғи маҳбуб амалдир. Ва бу билан бирга қуйидаги ҳадисдаги дуони ҳам қўшиб айтади:\n" +
                        "Амр ибн Шуҳайб оталаридан, оталари эса боболаридан қилган ривоятларида Расулуллоҳ соллаллоҳу алайҳи васаллам: «Агар сизлардан бирингиз бирор хотинга уйланадиган бўлса ёки бирор хизматкор сотиб оладиган бўлса, \n" +
                        "\n" +
                        "اللهُمَّ إنِّي أسْألُكَ خَيْرَهَا وَخَيرَ مَا جَبَلْتَهَا عَلَيهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا جَبَلْتَهَا عَلَيهِ\n" +
                        "\n" +
                        "«Аллоҳумма инний ас`алука хойраҳа ва хойра ма жабалтаҳа ъалайҳи. Ва аъузу бика мин шарриҳа ва шарри ма жабалтаҳа ъалайҳи», деб айтсин», дедилар. \n" +
                        "(Маъноси: «Аллоҳим, мен Сендан унинг яхшисини ва унга халқ қилган нарсангнинг яхшисини сўрайман. Ва унинг ёмонидан ва унга халқ қилган нарсангнинг ёмонидан Сенинг номинг ила паноҳ тилайман».)\n" +
                        "\n" +
                        "Абу Довуд, Ибн Можа ва Ибн Суннийлар ривояти."
            ),
            PrayerText(
                37,
                6,
                "Жимоъ пайтида",
                "Ибн Аббос розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Агар сизлардан бирингиз ўз аҳли ҳузурига келиб, (жимоъ қилишни хоҳлаб)\n" +
                        " \n" +
                        "بِسْمِ اللهِ اللهُمَّ جَنِّبْنَا الشَّيْطَانَ وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا\n" +
                        "\n" +
                        "«Бисмиллоҳи, Аллоҳумма жаннибнаш шайтона ва жаннибиш шайтона ма розақтана», деса, ўрталарида бола бўлиб қолса, унга у (шайтон) зарар бера олмайди», дедилар.\n" +
                        "(Маъноси: «Аллоҳнинг исми ила, Аллоҳим, бизни шайтондан ва шайтонни Сен бизга ризқ қилиб берган фарзандимиздан йироқ қилгин»).\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари."
            ),
            PrayerText(
                38,
                6,
                "Тўлғоқ тутаётганда",
                "Фотима розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Бу онамизнинг туғишлари яқинлашганида, Расулуллоҳ соллаллоҳу алайҳи васаллам Умму Салама ва Зайнаб бинти Жаҳшлар розияллоҳу анҳога Фотима розияллоҳу анҳунинг ҳузурларида «Оятал курси»ни ва Аъроф сурасининг 54-оятини охиригача ҳамда иккита «Қул аъузуни» ўқишни буюрдилар.\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n"
            ),
            PrayerText(
                39,
                6,
                "Бола туғилганда",
                "\n" +
                        "Абу Рофеъ розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Фотима розияллоҳу анҳо туққан пайтларида Расулуллоҳ соллаллоҳу алайҳи васаллам (неваралари) Ҳусайн ибн Алининг қулоғига намоздаги азонни айтдилар.\n" +
                        "\n" +
                        "Абу Довуд ва Термизийлар ривояти.\n" +
                        "\n" +
                        "Уламолар: «Боланинг ўнг қулоғига азон ва чап қулоғига иқомат (такбир) айтиш маҳбуб амалдир», деганлар.\n"
            ),
            PrayerText(
                40,
                6,
                "Фарзанд кўрганни табриклаганда",
                "Фарзанд кўрган кишини табриклаш маҳбуб амалдир. Бунга Ҳусайн розияллоҳу анҳудан қилинган қуйидаги ривоятдаги бир кишига ўргатилган жумлалар далилдир: \n" +
                        "\n" +
                        "بَارَكَ اللهُ لَكَ فِي الْمَوْهُوبِ لَكَ، وَشَكَرْتَ الوَاهِبَ، وَبَلَغَ أَشُدَّهُ، وَرُزِقت بِرُّهُ\n" +
                        "\n" +
                        "«Барокаллоҳу лака фил мавҳуби лака ва шакартал воҳиба ва балаға ашуддаҳу ва рузиқта бирруҳу»\n" +
                        "(Маъноси: «Берилган нарсада Аллоҳ сени баракали қилсин. Берувчига шукр қилишингни, фарзандинг вояга етишини ва итоатли бўлишини насиб этсин»).\n" +
                        "Табрикланган киши ҳам қуйидаги жумлалар ила жавоб қайтармоғи маҳбуб амалдир:\n" +
                        " \n" +
                        "بَارَكَ اللهُ لَكَ وَبَارَكَ عَلَيْكَ وَجَزَاكَ اللهُ خَيْرًا وَرَزَقَكَ اللهُ مِثْلَهُ أَوْ أَجْزَلَ اللهُ ثَوَابَكَ\n" +
                        "\n" +
                        "«Барокаллоҳу лака ва борака ъалайка ва жазокаллоҳу хойрон ва розақакаллоҳу мислаҳу ав ажзалаллоҳу савобака».\n" +
                        "(Маъноси: «Аллоҳ сенга барака бериб, сени баракали қилиб, яхшиликлар ила мукофотлантириб, унинг мислича ризқлантирсин ёки савобингни тўлалигича қилсин»)."
            ),
            PrayerText(
                41,
                6,
                "Ойнага қараганда",
                "Али розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам агар ойнага қарасалар,\n" +
                        "\n" +
                        "الْحَمْدُ للهِ، اللهُمَّ كَمَا حَسَّنْتَ خَلْقِي فَحَسِّنْ خُلُقِي\n" +
                        "\n" +
                        "«Алҳамду лиллаҳи, Аллоҳумма кама ҳассанта холқий фаҳассин хулуқий», деб айтардилар. \n" +
                        "(Маъноси: «Аллоҳга ҳамд бўлсин. Аллоҳим, яратилишимни яхши қилганингдек, хулқимни ҳам яхши қилгин».)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                42,
                6,
                "Меванинг биринчи ҳосилини кўрганда",
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Кишилар биринчи мевани кўрсалар, Расулуллоҳ соллаллоҳу алайҳи васалламга олиб келишар эди. Расулуллоҳ соллаллоҳу алайҳи васаллам уни олиб,\n" +
                        "\n" +
                        "اللهُمَّ بَارِكْ لَنَا فِي ثَمَرِنَا وَبَارِكْ لَنَا فِي مَدِيْنَتِنَا وَبَارِكْ لَنَا فِي صَاعِنَا وَبَارِكْ لَنَا فِي مُدِّنَا\n" +
                        "\n" +
                        "«Аллоҳумма борик лана фий самарина ва борик лана фий мадинатина ва борик лана фий соъина ва борик лана фий муддина», деб айтиб, сўнгра энг кичик болани чақириб, ўша мевани унга берар эдилар. \n" +
                        "(Маъноси: «Аллоҳим, меваларимизга барака бер. Шаҳримизга барака бер. Соъ ва муд ўлчовларимизга барака ато қил».)\n" +
                        "\n" +
                        "Имом Муслим ривоятлари."
            ),
            PrayerText(
                43,
                7,
                "Солиҳ фарзанднинг ота-онаси ҳаққига дуоси",
                "Исломий тарбия кўрган инсон ота-онаси кексайганда, уларни хорламайди, дилларини ранжитмайди. Уларнинг ҳақларига бундай дуо қилади:\n" +
                        "«Роббир-ҳамҳума кама роббайаний соғийро».\n" +
                        "Маъноси: «Парвардигоро, ота-онамга марҳамат эт, улар мени марҳамат-ла вояга етказганлари каби» \n" +
                        "\n" +
                        "Таҳрим сураси, 8-оят."
            ),
            PrayerText(
                44,
                7,
                "Истихора қилганда",
                "Жобир ибн Абдуллоҳ розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам бизга ҳамма ишларда истихорани худди Қуръондан сура ўргатгандек ўргатар эдилар. У зот: «Бирортангиз бир ишни қасд қилса, фарздан ташқари икки ракат намоз ўқисин. Сўнг: \n" +
                        "\n" +
                        "اللهُمَّ إِنِّي أَسْتَخِيرُكَ بِعِلْمِكَ وَأَسْتَقْدِرُكَ بِقُدْرَتِكَ وَأَسْأَلُكَ مِنْ فَضْلِكَ العَظِيم فَإِنَّكَ تَقْدِرُ وَلاَ أَقْدِرُ وَتَعْلَمُ وَلاَ أعْلَمُ وَأنْتَ عَلاَّمُ الغُيُوبِ؛ اللهُمَّ إِنْ كُنْتَ تَعْلَمُ أَنَّ هَذَا الأَمْرَ خَيْرٌ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أمْرِي أوْ قَالَ: عَاجِلِ أمْرِي وَآجِلِهِ فَاقْدُرْهُ لِي وَيَسِّرْهُ لِي ثُمَّ بَارِكْ لِي فِيهِ، وَإِنْ كُنْتَ تَعْلَمُ أنَّ هَذَا الأَمْرَ شَرٌّ لِي فِي دِينِي وَمَعَاشِي وَعَاقِبَةِ أمْرِي أوْ قَالَ: عَاجِلِ أمْرِي وَآجِلِهِ فَاصْرِفْهُ عَنِّي وَاقْدُرْ لِي الْخَيْرَ حَيْثُ كَانَ ثُمَّ رَضِّنِي بِهِ.\n" +
                        "\n" +
                        "«Аллоҳумма инний астахийрука биъилмика, ва астақдирука биқудротика ва ас`алука мин фазликал ъазийм. Фаиннака тақдиру ва ла ақдиру ва таъламу ва ла аъламу ва анта ъалламул ғуйуб. Аллоҳумма ин кунта таъламу анна ҳазал амро хойрун лий фий дийний ва маъаший ва ъақибати амрий, ъажили амрий ва ажилиҳи, фақдурҳу лий ва йассирҳу лий, сумма барик лий фийҳи ва ин кунта таъламу анна ҳазал амро шаррун лий фий дийний ва маъаший ва ъақибати амрий, ъажили амрий ва ажилиҳи фасрифҳу ъанний вақдурлийал хойро ҳайсу кана сумма роззиний биҳ», деб ҳожатини айтсин», дедилар.\n" +
                        "(Маъноси: Аллоҳим, Сенинг илминг билан Сендан яхшилик сўрайман. Сенинг қудратинг билан Сендан қодирлик ва улуғ фазлингни сўрайман. Сен (ҳар нарсага) қодирсан, мен қодир эмасман. Сен (ҳар нарсани) билувчисан, мен билмайман. Сен ғайбни билувчисан. Эй Раббим, агар мана шу қилаётган ишим (ҳожатининг номини айтади) динимда, яшашимда, ишларимнинг оқибатида, дунё ва охиратимда мен учун яхши бўлса, уни менга насиб эт ва осон қил. Сўнг уни менга баракотли қил. Агар мана шу ишим (ҳожатининг номини айтади) динимда, яшашимда, ишларимнинг оқибатида, дунё ва охиратимда мен учун ёмон бўлса, мендан уни узоқлаштир, қаерда бўлса ҳам, мен учун яхшиликни тақдир қил ва мени ундан рози эт.)\n" +
                        "\n" +
                        "Имом Бухорий ривоятлари."
            ),
            PrayerText(
                45,
                7,
                "Қийинчилик ва ғамчилик келганда",
                "Али розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам агар менга бирор қийинчилик ёки хафачилик етса, қуйидаги калималарни айтишни буюрдилар:\n" +
                        "\n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ الكَرِيْمُ العَظِيمُ، سُبْحَانَهُ تَبَارَكَ اللهُ رَبُّ العَرْشِ العَظِيمِ، الْحَمْدُ للهِ رَبِّ العَالَمِينَ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳу каримул ъазийм. Субҳанаҳу табарокаллоҳу роббул ъаршил ъазийм. Алҳамду лиллаҳи роббил ъаламийн».\n" +
                        "(Маъноси: Улуғ ва карим сифатли Аллоҳдан бошқа илоҳ йўқ. Улуғ арш Рабби Аллоҳ баракотли ва покдир. Оламлар рабби Аллоҳга ҳамд бўлсин.)\n" +
                        "\n" +
                        "Насаий ва Ибн Сунний ривоятлари."
            ),
            PrayerText(
                46,
                7,
                "Бирор нарсадан қўрққанда",
                "Амр ибн Шуайб оталаридан, оталари боболаридан ривоят қиладилар.\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам бирор нарсадан қўрққан кишиларга:\n" +
                        "\n" +
                        "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ غَضَبِهِ وَشَرِّ عِبَادِهِ وَمِنْ هَمَزَاتِ الشَّيَاطِينِ وَأَنْ يَحْضُرُونِ\n" +
                        "\n" +
                        "«Аъузу бикалиматиллаҳит таммаҳ мин ғозобиҳи ва шарри ъибадиҳи ва мин ҳамазатиш шайатийни ва ан йаҳзуруни», деб айтишни ўргатар эдилар.\n" +
                        "(Маъноси: Аллоҳнинг мукаммал калималари билан ғазабидан ва бандаларининг ёмонлигидан ва шайтон васваса қилиб, менинг ёнимда ҳозир бўлишидан паноҳ тилайман.)\n" +
                        "\n" +
                        "Абу Довуд ва Термизийлар ривояти."
            ),
            PrayerText(
                47,
                7,
                "Ғам ёки ташвиш етганида",
                "Абу Мусо Ашъарий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимга ғам-ташвиш етса, ушбу калималар билан дуо қилсин, деганларида, бир киши: «Эй Расулуллоҳ мана шу калималардан бебаҳра қолган киши хасоратдами» деди, Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ҳа», деб жавоб бердилар. Сўнгра, «Бу калималарни ўзинглар айтиб, бошқаларга ҳам ўргатинглар. Ким бир нарса талабида ана шу калималарни айтса, Аллоҳ ундан хафаликни кетказиб, хурсандчилигини зиёда қилади», деб ўша калималарни айтдилар: \n" +
                        "\n" +
                        "اللهُمَّ إنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ نَاصِيَتِي بِيَدِكَ مَاضٍ فِيَّ حُكْمُكَ عَدْلٌ فِيَّ قَضَاؤُكَ؛ أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ سَمَّيْتَ بِهِ نَفْسَكَ أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ أَوْ عَلَّمْتَهُ أَحَدًا مِنْ خَلْقِكَ أوِ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيْبِ عِنْدَكَ أَنْ تَجْعَلَ القُرْآنَ نُورَ صَدْرِي وَرَبِيعَ قَلْبِي وَجِلاَءَ حُزْنِي وَذَهَابَ هَمِّي.\n" +
                        "\n" +
                        "«Аллоҳумма инний ъабдука, ибну ъабдика, ибну аматика, насийатий бийадик, мазин фиййа ҳукмук, ъадлун фиййа қозоук, ас`алука бикулли исмин ҳува лака саммайта биҳи нафсака ав анзалтаҳу фи китабика ав ъалламтаҳу аҳадан мин холқика ав иста`сарта биҳи фий ъилмил ғойби ъиндака ан тажъалал Қуръана нуро содрий ва робийъа қолбий ва жилаа ҳузний ва заҳаба ҳаммий».\n" +
                        "(Маъноси: Мен Сенинг қулингман, қулингнинг ўғлиман, чўрингнинг зурриётиман. Пешонам Сенинг қўлингда. Ҳукминг менинг устимда жорийдир. Сенинг ҳукминг одилдир. Ўзингни номлаган ёки китобингда нозил қилган ёки халқингдан бирор кишига ўргатган ёки ғайб илмингда сақлаб қўйган исмларинг ила сўрайманки, Қуръонни дилимнинг нури, қалбимнинг баҳори, маҳзунлигимни аритувчи ва ғамимни кеткизувчи қил).\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                48,
                7,
                "Қийин аҳволга тушиб қолганда",
                "Али розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам менга: «Эй Али, қийин аҳволга тушиб қолганда айтиладиган калималарни ўргатайми?» дедилар. «Аллоҳ мени сизга фидо қилсин, ўргатинг», дедим. Расулуллоҳ соллаллоҳу алайҳи васаллам: «Агар қийин аҳволга тушиб қолсанг, \n" +
                        "\n" +
                        "بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ، وَلاَ حَولَ وَلاَ قُوَّةَ إلاَّ بِاللهِ العَلِيِّ العَظِيمِ\n" +
                        "\n" +
                        "«Бисмиллаҳир роҳманир роҳийм. Ва ла ҳавла ва ла қуввата илла биллаҳил ъалиййил ъазийм», деб айт. Чунки Аллоҳ мана шу дуо билан хоҳлаганича, турли балолардан халос қилади», дедилар».\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n"
            ),
            PrayerText(
                49,
                8,
                "Бир қавмдан қўрққанда",
                "Абу Мусо Ашъарий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам агар бирор қавмдан хавфсирасалар:\n" +
                        "\n" +
                        "اللهُمَّ إِنَّا نَجْعَلُكَ فِي نُحُورِهِمْ وَنَعُوذُ بِكَ مِنْ شُرُورِهِمْ\n" +
                        "\n" +
                        "«Аллоҳумма инна нажъалука фий нуҳуриҳим ва наъузу бика мин шуруриҳим», деб айтардилар.\n" +
                        "(Маъноси: Эй Раббим, биз Сени уларга рўпара қўямиз ва Сенинг номинг ила уларнинг ёмонлигидан паноҳ тилаймиз.)\n" +
                        "\n" +
                        "Абу Довуд ва Насаий ривоятлари."
            ),

            PrayerText(
                50,
                8,
                "Султондан қўрққанда",
                "\n" +
                        "Ибн Умар розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам менга: «Агар султондан ёки бошқа кишидан қўрқсанг:\n" +
                        "\n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ الْحَلِيمُ الْحَكِيمُ سُبْحَانَ اللهِ رَبِّ السَّمَوَاتِ السَّبْعِ وَرَبِّ العَرْشِ العَظِيمِ لاَ إِلَهَ إِلاَّ أَنْتَ عَزَّ جَارُكَ وَجَلَّ ثَنَاؤُكَ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳул ҳалиймул ҳакийм. Субҳаналлоҳи роббис самаватис сабъи ва роббил ъаршил ъазийм, ла илаҳа илла анта ъазза жарука ва жалла санаука», деб айт», дедилар». \n" +
                        "(Маъноси: Ҳаким ва Ҳалим сифатли Аллоҳдан бошқа илоҳ йўқ. Етти осмон ва улуғ аршнинг рабби Аллоҳ покдир. Сендан бошқа илоҳ йўқ. Ҳимоянг азиз бўлди. Саноинг улуғ бўлди.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n"
            ),
            PrayerText(
                51,
                8,
                "Душманга йўлиққанда",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам:\n" +
                        "\n" +
                        "اللهُمَّ لاَ سَهْلَ إِلاَّ ما جَعَلْتَهُ سَهْلاً وَأنْتَ تَجْعَلُ الْحَزْنَ إذَا شِئْتَ سَهْلاً\n" +
                        "\n" +
                        "«Аллоҳумма ла саҳла илла ма жаъалтаҳу саҳлан ва анта тажъалул ҳазна иза ши`та саҳла», деб айтардилар.\n" +
                        "(Маъноси: Аллоҳим, Сен енгил этган нарсагина енгилдир. Агар Сен хоҳласанг, қаттиқ ерни ҳам текис қилувчисан.) \n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                52,
                8,
                "Бир иш оғирлик қилганида",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам:\n" +
                        "\n" +
                        "اللهُمَّ لاَ سَهْلَ إِلاَّ ما جَعَلْتَهُ سَهْلاً وَأنْتَ تَجْعَلُ الْحَزْنَ إذَا شِئْتَ سَهْلاً\n" +
                        "\n" +
                        "«Аллоҳумма ла саҳла илла ма жаъалтаҳу саҳлан ва анта тажъалул ҳазна иза ши`та саҳла», деб айтардилар.\n" +
                        "(Маъноси: Аллоҳим, Сен енгил этган нарсагина енгилдир. Агар Сен хоҳласанг, қаттиқ ерни ҳам текис қилувчисан.) \n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),

            PrayerText(
                53,
                8,
                "Яшаш қийинлашганда",
                "Ибн Умар розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Бирортангизнинг яшаши қийинлашиб қолса, уйидан кўчага чиқаётиб қуйидаги дуоларни айтишдан нима ман қилади?» дедилар:\n" +
                        "\n" +
                        "بِسْمِ اللهِ عَلَى نَفْسِي وَمَالِي وَدِينِي، اللهُمَّ رَضِّنِي بِقَضَائِكَ وَبَارِكْ لِي فِيمَا قُدِّرَ لِي حَتَّى لاَ أحِبَّ تَعْجِيلَ مَا أخَّرْتَ وَلاَ تَأْخِيرَ مَا عَجَّلْتَ\n" +
                        "\n" +
                        "«Бисмиллаҳи ъала нафсий ва малий ва диний. Аллоҳумма роззиний биқозоика ва барик лий фийма қуддиро лий  ҳатта ла уҳибба таъжийла ма аххорта ва ла та`хийро ма ъажжалта». \n" +
                        "(Маъноси: Нафсим, молим ва динимга Аллоҳнинг исмини айтаман. Эй Раббим, қазои қадарингдан мени рози эт. Ва тақдир қилган нарсангни мен учун баракали қил. Токи, кечиктирган нарсангни шошилтиришни ва шошилтирган нарсангни кечиктиришни яхши кўрмайин.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                54,
                8,
                "Офатни даф қилишда",
                "Анас ибн Молик розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Аллоҳ таоло бир бандага аҳли аёли, моли ва фарзандида бир неъмат берса, у: \n" +
                        "\n" +
                        "مَا شَاءَ اللهُ لاَ قُوَّةَ إِلاَّ بِاللهِ\n" +
                        "\n" +
                        "«Ма ша`аллоҳу ла қуввата илла биллаҳи» деб айтса, шу неъматларда ўлимдан бошқа офат кўрмайди», дедилар.\n" +
                        "(Маъноси: Аллоҳнинг хоҳлагани бўлади. Аллоҳдан бошқада қувват йўқ.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                55,
                8,
                "Катта-кичик мусибат етганида",
                "Аллоҳ таоло Бақара сурасининг 155 - 156-оятларида:\n" +
                        "«Бирор мусибат етса: «Албатта, биз Аллоҳнинг (бандаларимиз) ва албатта, биз У зотга қайтгувчилармиз», дейдиган собирларга хушхабар беринг. Ана ўшаларга Парвардигорлари томонидан саловот (мағфират) ва раҳмат бордир. Ана ўшалар ҳақ йўлни топгувчилардир», деб айтган.\n" +
                        "\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ҳар бир нарсада истиржоъ яъни, \n" +
                        "إِنَّا للهِ وَإنَّا إلَيهِ رَاجِعُون\n" +
                        "\n" +
                        "«Инна лиллаҳи ва инна илайҳи рожиъун», айтинг, ҳатто оёқ кийимингизнинг ипи (узилгани) учун ҳам, чунки у ҳам мусибатдир», дедилар».\n" +
                        "(Маъноси: Албатта, биз Аллоҳнинг (бандаларимиз) ва албатта, биз У зотга қайтгувчилармиз).\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                56,
                8,
                "Қарзини тўлашга қурби етмаганида\n",
                "Али розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Бир қул озод бўлиш учун шартлашилган баҳодаги маблағни тополмай, Ҳазрати Али розияллоҳу анҳудан ёрдам сўради. Шунда у зот: «Сенга Расулуллоҳ ўргатган калималарни ўргатайми? Агар: \n" +
                        "\n" +
                        "اللهُمَّ اكْفِنِي بِحَلاَلِكَ عَنْ حَرَامِكَ وَأغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ\n" +
                        "\n" +
                        "«Аллоҳумма икфиний биҳалалика ъан ҳаромика ва ағниний бифазлика ъамман сивака» дуосини ўқиб юрсанг, қарзинг тоғнинг бир тарафича бўлса ҳам, халос бўласан», дедилар.\n" +
                        "(Маъноси: Эй Раббим, ҳаром (аралаштирмай) ҳалолинг билан менга кифоя эт. Фазлинг ила Ўзингдан бошқалардан беҳожат қил.)\n" +
                        "\n" +
                        "Имом Термизий ривоятлари."
            ),
            PrayerText(
                57,
                9,
                "Васвасага йўлиққанда",
                "Аллоҳ таоло Фуссилат сурасининг 36-оятида: «Агар сизни шайтон томонидан бирор васваса йўлдан оздирса, Аллоҳдан паноҳ сўранг. Албатта, У эшитувчи ва билувчи зотдир», деди.\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Сизлардан бирортангизга шайтон келиб: «Уни ким яратди?» «Буни ким яратди?» деб савол беради, ҳатто, «Раббингни ким яратди?» дейишгача боради. Ана шунда у Аллоҳдан паноҳ сўрасин ва (фикрига) барҳам берсин», дедилар.\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари.\n" +
                        "\n" +
                        "Бошқа саҳиҳ ривоятда айтилади: «Инсонлар сўрашда давом этишади, ҳатто: «Аллоҳ бутун махлуқотни яратди. Унда Аллоҳни ким яратди?» дейишади. Кимнинг қалбида шу савол пайдо бўлса, \n" +
                        "\n" +
                        "آمَنْتُ بِاللهِ وَرُسُلِهِ\n" +
                        "\n" +
                        "«аманту биллаҳи ва русулиҳи» (Аллоҳга ва Унинг расулларига иймон келтирдим), деб айтсин».\n"
            ),

            PrayerText(
                58,
                9,
                "Эси оғганда ва бирор нарса чаққанда",
                "Абдураҳмон ибн Абу Лайло розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Бир киши Расулуллоҳ соллаллоҳу алайҳи васаллам ҳузурларига келиб: «Менинг иним касал», деди. Расулуллоҳ соллаллоҳу алайҳи васаллам: «Унинг касали нима?» деб сўрадилар. У киши: «Бир оз жунунлиги бор», деди. Набий соллаллоҳу алайҳи васаллам: «Уни менга олиб кел», дедилар. У кишини олиб келишди. Набий соллаллоҳу алайҳи васаллам беморни олдиларига ўтқизиб, унга Фотиҳа сурасини, Бақаранинг аввалги тўрт оятини ва ўртадаги икки оятини (яъни, 163-164-оятларини), Оятул курсийни, яна Бақаранинг охирги уч оятини, Оли Имроннинг илк ва 18-оятини, Аърофнинг 54-оятини, Мўминуннинг 116-оятини, Жин сурасининг 3-оятини, Соффат сурасининг аввалги ўн оятини, Ҳашрнинг охирги уч оятини, «Қул ҳуваллоҳу аҳад»ни, «Қул аъузу бироббил фалақ»ни, «Қул аъузу бироббин нас»ни ўқидилар. \n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n" +
                        "\n" +
                        "Абдуллоҳ ибн Масъуд розияллоҳу анҳу дардга чалинган бир кишининг қулоғига ниманидир ўқидилар. У соғайиб кетди. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Унинг қулоғига нима деб айтдинг?» деганларида,  «Мўминун» сурасининг 115-оятидан то охиригача ўқиганларининг хабарини бердилар. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Агар бирор киши мана шу оятларни ишонч билан ўқиса, тоғни ҳам майдалаб юборади», дедилар.\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n"
            ),
            PrayerText(
                59,
                9,
                "Болаларга паноҳ тилаганда",
                "Ибн Аббос розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам Ҳасан ва Ҳусайнларга \n" +
                        "\n" +
                        "أعِيذُكُمَا بِكَلِمَاتِ اللهِ التَّامَّةِ مِنْ كُلِّ شَيْطَانٍ وَهَامَّةٍ وَمِنْ كُلِّ عَيْنٍ لاَمَّةٍ\n" +
                        "\n" +
                        "«Уъийзукума бикалиматиллаҳит таммати мин кулли шайтонин ва ҳаммаҳ ва мин кулли ъайнин ламмаҳ», дуосини ўқиб паноҳ тилар ва: «Бу дуо отангиз Исмоил ва Исҳоқ алайҳимуссаломларнинг паноҳ тилайдиган дуолари эди», деб айтар эдилар. \n" +
                        "(Маъноси: Аллоҳнинг мукаммал калималари билан ҳар бир шайтондан, зарарли ҳашаротлардан ва ёмон кўздан сизларга паноҳ тилайман.)\n" +
                        "\n" +
                        "Имом Бухорий ривоятлари."
            ),
            PrayerText(
                60,
                9,
                "Ғазаб келганда",
                "Оиша розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам ҳузуримга кирдилар. Ўша пайтда жаҳлим чиқиб турган эди. Бурнимнинг бир тарафини ушлаб тортдилар-да, «Эй Увайш (Оиша исмининг қисқартмаси),\n" +
                        "\n" +
                        "اللهُمَّ اغْفِرْ لِي ذَنْبِي وَأَذْهِبْ غَيْظَ قَلْبِي وَأَجِرْنِي مِنَ الشَّيْطَانِ\n" +
                        "\n" +
                        "«Аллоҳумма иғфирлий занбий ва азҳиб ғойза қалбий ва ажирний минаш шайтони», деб айт», дедилар». \n" +
                        "(Маъноси: «Аллоҳим, гуноҳларимни кечириб, қалбим ғазабини кетказ ва шайтондан сақлагин».)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                61,
                9,
                "Яхшилик қилган кишига",
                "Усома ибн Зайд розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: \n" +
                        "«Кимга яхшилик қилинса, бажарувчисига\n" +
                        " \n" +
                        "جَزَاكَ اللهُ خَيْرًا\n" +
                        "\n" +
                        "«Жазокаллоҳу хойрон», яъни Аллоҳ яхшилик ила мукофотласин, деса, мақташнинг энг етугини қилибди», дедилар.\n" +
                        "\n" +
                        "Имом Термизий ривоятлари."
            ),
            PrayerText(
                62,
                9,
                "Кўз тегиб зарарланишдан қўрққанда",
                "Саид ибн Ҳаким розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам агар бирор нарсада кўз тегишидан қўрқсалар, \n" +
                        "\n" +
                        "اللهُمَّ بَارِكْ فِيْهِ وَلاَ تَضُرَّهُ\n" +
                        "\n" +
                        "«Аллоҳумма борик фийҳи вала тазурраҳу», деб айтардилар.\n" +
                        "(Маъноси: «Аллоҳим, унда барака бериб, зарар бермагин».)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n" +
                        "\n" +
                        "Анас розияллоҳу анҳудан ривоят қилинади: \n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки бирор нарса кўриб ажабланса,\n" +
                        "\n" +
                        "مَا شَاءَ اللهُ لاَ قُوَّةَ إِلاَّ بِاللهِ\n" +
                        "\n" +
                        "«Ма шааллоҳу ла қуввата илла биллаҳи», деса унга зарар етмайди», дедилар. \n" +
                        "(Маъноси: «Аллоҳ хоҳлагани бўлади. Аллоҳдан бошқа қувват йўқ».)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n"
            ),
            PrayerText(
                63,
                9,
                "Бирор нарсадан шумлангада",
                "Урва ибн Омир ал-Жуҳаний розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васалламдан шумланиш ҳақида сўралганда, «Унинг тўғриси некбинликдир, мусулмонни шумланиш (орқага) қайтара олмайди. Агар шумланишдан бирор кариҳ нарсани кўрсанглар,\n" +
                        "\n" +
                        "اللَّهُمَّ لاَ يَأْتِي بِالْحَسَنَاتِ إِلاَّ أَنْتَ وَلاَ يَذْهَبُ بِالسَّيِّئاتِ إِلاَّ أَنْتَ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ\n" +
                        "\n" +
                        "«Аллоҳумма ла я‘тий билҳасаноти илла анта вала язҳабу биссаййи‘оти илла анта вала ҳавла вала қуввата илла биллаҳи», деб айтинглар», дедилар.\n" +
                        "(Маъноси: «Аллоҳим, яхшиликларни Сен олиб келасан. Ёмонликларни ҳам Сен кетказасан. Сендан бошқа бирор ўзгартирувчи ҳам, қувват ҳам йўқдир».)\n" +
                        "\n" +
                        "Ибн Сунний ва бошқалар ривоятлари."
            ),
            PrayerText(
                64,
                10,
                "Аъзолар йиринглаганда ва нарса тошганда",
                "Расулуллоҳ соллаллоҳу алайҳи васалламнинг аёлларидан бири ривоят қиладилар:«Расулуллоҳ соллаллоҳу алайҳи васаллам менинг ҳузуримга кирдилар. Бармоғим яллиғланган эди. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: «Сенда ғаров қамиши (Ҳиндистондан келтирилган ўсимлик) борми?» деб сўрадилар. Уни бармоғимга қўйдилар ва:\n" +
                        "\n" +
                        "اللهُمَّ مُصَغِّرَ الكَبِيرِ وَمُكَبِّرَ الصَّغِيرِ صَغِّرْ مَا بِي\n" +
                        "\n" +
                        "«Аллоҳумма мусағғирол кабийр ва мукаббирос соғийр, соғғир ма бий», деб айт, шунда у сендан йўқолади», дедилар».\n" +
                        "(Маъноси: Эй каттани кичик, кичикни катта қилувчи Зот, мендаги нарсани кичик қил.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                65,
                10,
                "Касал бўлганда",
                "Оиша розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васалламга биров бир нарсадан - чақами, жароҳатми - шикоят қиладиган бўлса, кўрсаткич бармоқларини ерга қўйиб, сўнгра кўтариб, қуйидаги дуони ўқир эдилар: \n" +
                        "\n" +
                        "بِسْمِ اللهِ تُرْبَةُ أرْضِنَا بِرِيقَةِ بَعْضِنَا يُشْفَى بِهِ سَقِيمُنَا بِإِذْنِ رَبِّنَا\n" +
                        "\n" +
                        "«Бисмиллаҳи турбату арзина бирийқоти баъзина йушфа биҳи сақиймуна биизни роббина». \n" +
                        "(Маъноси: Аллоҳнинг исми билан, ерларимизнинг тупроғи билан, баъзиларимизнинг тупуги билан Раббимизнинг изни ила касалларимиз шифо топади.)\n" +
                        "\n" +
                        "Имом Бухорий, Муслим, Абу Довуд ва бошқалар ривоят қилишган.\n" +
                        "\n" +
                        "Оиша розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам аҳлларидан баъзиларига ўнг қўлларини суртиб, паноҳ тилаб, қуйидаги дуони ўқирдилар: \n" +
                        "\n" +
                        "اللهُمَّ رَبَّ النَّاسِ أذْهِبِ البَأْسَ اشْفِ أنْتَ الشَّافِي لاَ شِفَاءَ إِلاَّ شِفَاؤُكَ شِفَاءً لاَ يُغَادِرُ سَقَمًا\n" +
                        "\n" +
                        "«Аллоҳумма роббан наси азҳибил ба`са ишфи анта шафий ла шифаа илла шифаука шифаан ла йуғодиру сақома».\n" +
                        "(Маъноси: Аллоҳим, Сен инсонларнинг раббисан, қийинчиликларни кетказ, шифо бер, Сен шифо берувчисан. Сенинг шифоингдан бошқа шифо йўқ. Сен берган шифо бирорта ҳам касаллик қолдирмайди.)\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари."
            ),
            PrayerText(
                66,
                10,
                "Бош оғриғи, иситма ва бошқа оғриқларда",
                "Ибн Аббос розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам барча касалликларга ва иситма чиққанида: \n" +
                        "\n" +
                        "بِسْمِ اللهِ الكَبِيرِ نَعُوذُ بِاللهِ العَظِيمِ مِنْ شَرِّ عِرْقٍ نَعَّارٍ وَمِنْ شَرِّ حَرِّ النَّارِ\n" +
                        "\n" +
                        "«Бисмиллаҳил кабийр, наъузу биллаҳил ъазийм, мин шарри ъирқин наъъар, ва мин шарри ҳаррин нар», деб айтишни ўргатар эдилар.\n" +
                        "(Маъноси: Буюк Аллоҳнинг исми билан бошлайман. Улуғ Аллоҳнинг номи ила томирдан шовуллаб оқувчи қоннинг ёмонидан ва дўзах ўтининг ёмонидан паноҳ тилайман.) \n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                67,
                10,
                "Ўлим яқинлашганда",
                "Оиша розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васалламнинг ўлимлари яқинлашган эди. Олдларида бир қадаҳда сув бор эди. Унга қўлларини тиқдилар, сўнг сувини юзларига суртиб: \n" +
                        "\n" +
                        "اللهُمَّ أعِنِّي عَلَى غَمَرَاتِ الْمَوْتِ وَسَكَرَاتِ الْمَوْتِ\n" +
                        "\n" +
                        "«Аллоҳумма аъинний ъала ғомаротил мавти ва сакаротил мавт», деб айтдилар». \n" +
                        "(Маъноси: Аллоҳим, ўлим шиддати ва ўлим талвасасида менга ёрдам бер.)\n" +
                        "Термизий ва Ибн Можа ривоятлари.\n" +
                        "\n" +
                        "Яна Оиша онамиз розияллоҳу анҳо айтадилар: «Расулуллоҳ соллаллоҳу алайҳи васаллам менга суяниб туриб: \n" +
                        "\n" +
                        "اللهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَألْحِقْنِي بِالرَّفِيقِ الأَعْلَى\n" +
                        "\n" +
                        "«Аллоҳуммағфирли варҳамний ва алҳиқний биррофиқил аъла», деганларини эшитдим». \n" +
                        "(Маъноси: Аллоҳим, мени мағфират қил ва менга раҳм эт. Мени Олий дўст билан қовуштир.)\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари.\n" +
                        "\n" +
                        "Абу Ҳурайра ва Абу Саид Худрийлар розияллоҳу анҳумадан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам ўлим тўшагида ётганларга «Ла илаҳа иллаллоҳ»ни айтиб туришни буюрдилар».\n" +
                        "\n" +
                        "Имом Муслим, Абу Довуд, Термизий, Насаий ривоятлари."
            ),
            PrayerText(
                68,
                10,
                "Кишининг яқин инсони вафот этганида",
                "Умму Салама онамиз розияллоҳу анҳо айтадилар:\n" +
                        "«Расулуллоҳ соллаллоҳу алайҳи васаллам: «Бирор бандага мусибат етганида: \n" +
                        "\n" +
                        "إِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ؛ اللهُمَّ اجُرْنِي فِي مُصِيبَتِي وَاخْلُفْ لِي خَيْرًا مِنْهَا\n" +
                        "\n" +
                        "«Инна лиллаҳи ва инна илайҳи рожиъун, Аллоҳумма ажурний фий мусийбатий вахлуфлий хойром минҳа» (Биз Аллоҳникимиз ва Аллоҳга қайтувчимиз. Эй Раббим, мусибатимда ажр қил ва менга ундан яхшироғини бер), деб айтса, Аллоҳ таоло мусибатига ажр бериб, ундан яхшисини ато этади», дедилар"
            ),
            PrayerText(
                69,
                10,
                "Дўстининг ўлими ҳабари етганида",
                "Ибн Аббос розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ўлим қўрқинчдир. Сизларнинг бирингизга биродарининг ўлими хабари етса: \n" +
                        "\n" +
                        "إِنَّا للهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ، اللهُمَّ اكْتُبْهُ عِنْدَكَ فِي الْمُحْسِنِينَ وَاجْعَلْ كِتَابَهُ فِي عِلِّيِّينَ وَاخْلُفْهُ فِي أهْلِهِ فِي الغَابِرِينَ وَلاَ تَحْرِمْنَا أجْرَهُ وَلاَ تَفْتِنَّا بَعْدَهُ\n" +
                        "\n" +
                        "«Инна лиллаҳи ва инна илайҳи рожиъун ва инна ила роббина ламунқолибун, Аллоҳуммактубҳу ъиндака фил муҳсинийна важъал китабаҳу фий ъиллиййин вахлуфҳу фий аҳлиҳи фил ғобирийн ва ла таҳримна ажроҳу ва ла тафтинна баъдаҳ», деб айтсин», дедилар.\n" +
                        "(Маъноси: Биз Аллоҳникимиз ва Унга қайтувчимиз. Ва, албатта, биз Раббимизга қайтажакмиз. Эй Раббим, ўзингнинг ҳузурингда уни яхшилардан деб ёз. Ва унинг китобини Иллиййинда (еттинчи осмонда-номаи аъмоллар битилган маконда) қил. Орқасида қолганларга Ўзинг унинг ўрнини бос. Унинг ажрини бизлардан маҳрум қилма. Ундан кейин бизларни фитнага солма.)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                70,
                10,
                "Жаноза дуоси",
                "\n" +
                        "اللهُمَّ اغْفِرْ لِحَيِّنَا وَمَيِّتِنَا وَشَاهِدِنَا وَغَائِبِنَا وَصَغِيرِنَا وَكَبِيرِنَا وَذَكَرِنَا وَأُنْثَانَا. اللهُمَّ مَنْ احْيَيْتَهُ مِنَّا فَأحْيِهِ عَلَى الإِسْلاَمِ وَمَنْ تَوَفَّيْتَهُ مِنَّا فَتَوَفَّهُ عَلَى الإِيْمَانِ؛ اللهُمَّ لاَ تَحْرِمْنَا أجْرَهُ وَلاَ تَفْتِنَّا بَعْدَهُ\n" +
                        "\n" +
                        "«Аллоҳуммағфир лиҳаййина ва маййитина ва шаҳидина ва ғоибина ва соғийрина ва кабийрина ва закарина ва унсана. Аллоҳумма ман  аҳйайтаҳу минна фааҳйиҳи ъалал ислам ва ман таваффайтаҳу минна фатаваффаҳу ъалал ийман. Аллоҳумма ла таҳримна ажроҳу ва ла тафтинна баъдаҳу».\n" +
                        "(Маъноси: Эй Раббим, тиригу ўлигимизни, ҳозиру ғойибимизни, кичигу каттамизни, эркагу аёлимизни мағфират қил. Эй Раббим, кимимизни ҳаётда қолдирадиган бўлсанг, уни Исломда қил, кимимизни ўлдирадиган бўлсанг, уни иймон билан вафот эттир. Бизни унинг ажридан маҳрум қилма. Ундан кейин бизни фитнага солма.)\n" +
                        "\n" +
                        "Агар маййит ёш бола бўлса, қуйидаги дуони ўқийди: \n" +
                        "\n" +
                        "اللهُمَّ اجْعَلْهُ لَهُمَا فَرَطًا وَاجْعَلْهُ لَهُمَا سَلَفًا وَاجْعَلْهُ لَهُمَا ذُخْرًا وَثَقِّلْ بِهِ مَوَازِينَهُمَا وَأَفْرِغِ الصَّبْرَ عَلَى قُلُوبِهِمَا وَلاَ تَفْتِنْهُمَا بَعْدَهُ وَلاَ تَحْرِمْهُمَا أَجْرَهُ\n" +
                        "\n" +
                        "«Аллоҳуммажъалҳу лаҳума фаротан важъалҳу лаҳума салафан важъалҳу лаҳумо зуҳрон ва саққил биҳи мавазийнаҳума ва африғис собро ъала қулубиҳима ва ла тафтинҳума баъдаҳу ва ла таҳримҳума ажраҳ».\n" +
                        "(Маъноси: Аллоҳим, бу гўдакни  ота-оналари учун ажр, фазл ва заҳира қил. У сабабли ота-онасининг тарозиларини оғир қил, қалбларига сабр ёғдир. Ундан сўнг уларни фитнага солма, уларни унинг ажридан маҳрум қилма.)\n"
            ),
            PrayerText(
                71,
                11,
                "Маййитни олиб кетилаётганини кўрганда",
                "Тобутни кўрганда:\n" +
                        "\n" +
                        "سُبْحَانَ الْحَيِّ الَّذِي لاَ يَمُوتُ\n" +
                        "\n" +
                        "«Субҳанал ҳаййиллазий ла йамут» (Ҳаргиз ўлмайдиган, абадий тирик зот Аллоҳ покдир), деб айтиш мустаҳабдир. Ёки Абулмаҳосин Равйоний «Баҳр» номли китобларида келтирганларидек,\n" +
                        " \n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ الْحَيُّ الَّذِي لاَ يَمُوتُ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳу ҳаййуллазий ла йамут», деб айтиб, сўнг маййитни яхшилик билан эсланади ва унинг ҳаққига дуо қилинади.\n"
            ),
            PrayerText(
                72,
                11,
                "Маййитни қабрга қўяётганда",
                "Ибн Умар розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ алайҳиссалом маййитни қабрга қўяётганларида:\n" +
                        "\n" +
                        "بِسْمِ اللهِ وَعَلَى سُنَّةِ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\n" +
                        "\n" +
                        "«Бисмиллаҳи ва ъала суннати росулиллаҳ», деб айтардилар.\n" +
                        "(Маъноси: Аллоҳнинг исми билан, Расулуллоҳнинг суннатларига мувофиқ.)\n" +
                        "\n" +
                        "Абу Довуд, Термизий, Байҳақийлар ривояти.\n" +
                        "\n" +
                        "(Баъзи ривоятда «ъала суннати»нинг ўрнига «ъала миллати» бўлиб келган.)"
            ),
            PrayerText(
                73,
                5,
                "Қаттиқ шамол бўлганда",
                "Оиша онамиз розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Агар қаттиқ шамол бўлса, Расулуллоҳ соллаллоҳу алайҳи васаллам: \n" +
                        "\n" +
                        "اللهُمَّ إِنِّي أَسْأَلُكَ خَيْرَهَا وَخَيْرَ مَا فِيهَا وَخَيْرَ مَا ارْسِلَتْ بِهِ وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيهَا وَشَرِّ مَا أَرْسِلَتْ بِهِ\n" +
                        "\n" +
                        "«Аллоҳумма инний ас`алука хойроҳа ва хойро ма фийҳа ва хойро ма урсилат биҳи ва аъузу бика мин шарриҳа ва шарри ма фийҳа ва шарри ма урсилат биҳи», деб айтар эдилар. \n" +
                        "(Маъноси: Эй Раббим, Сендан унинг яхшисини, ундаги яхшиликни ва у билан юборилган нарсанинг яхшисини сўрайман. Эй Раббим, Сендан унинг ёмонидан, ундаги ёмонликдан ва у билан юборилган нарсанинг ёмонлигидан паноҳ сўрайман). \n" +
                        "\n" +
                        "Имом Муслим ривоятлари."
            ),
            PrayerText(
                74,
                5,
                "Касаллик билан балоланган кишини кўрганда",
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки (ногиронлик ва беморлик ила) балоланган кишини кўриб,\n" +
                        "\n" +
                        "الْحَمْدُ للهِ الَّذِي عَافَانِي مِمَّا ابْتَلاَكَ بِهِ وَفَضَّلَنِي عَلَى كَثِيْرٍ مِمَّنْ خَلَقَ تَفْضِيْلاً\n" +
                        "\n" +
                        "«Алҳамду лиллаҳиллазий ъафаний мимма ибталака биҳи ва фаззаланий  ъала касирин мимман холақо тафзийла», деса, унга ана шу бало етмайди», дедилар.\n" +
                        "(Маъноси: «У касаллик билан балолаган нарсангда мени офиятда қилганинг учун ва одамлар орасида мени кўпроқ фазилатли қилганинг учун Сенга ҳамд бўлсин».)\n" +
                        "\n" +
                        "Имом Термизий ҳасан иснод ила ривоят қилганлар."
            ),
            PrayerText(
                75,
                5,
                "Қон олдирганда",
                "\n" +
                        "Али розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки қон олдираётган пайтда «Оятал курси»ни ўқиса, ўша олдираётган қони манфаатли бўлади», дедилар.\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари"
            ),
            PrayerText(
                76,
                5,
                "Қулоқ шанғилланда",
                "Расулуллоҳ соллаллоҳу алайҳи васалламнинг мавлолари Абу Рофеъдан ривоят қилинади.\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Агар сизлардан бирингизнинг қулоғи шанғилласа, мени эсласин ва менга саловот айтиб,\n" +
                        " \n" +
                        "ذَكَرَ اللهُ بِخَيْرٍ مَنْ ذَكَرَنِي\n" +
                        "\n" +
                        "«Закараллоҳу бихойрин ман закараний», деб айтсин», дедилар.\n" +
                        "(Маъноси: «Мени эслаган кишини Аллоҳ яхшилик ила эсласин».)\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари.\n"
            ),
            PrayerText(
                77,
                5,
                "Юлдуз учганда",
                "Ибн Масъуд розияллоҳу анҳу: «Агар юлдуз учса, унга қарамасликка ва:\n" +
                        "\n" +
                        "مَا شَاءَ اللهُ لاَ قُوَّةَ إلاَّ بِاللهِ\n" +
                        "\n" +
                        "«Ма ша`аллоҳу ла қуввата илла биллаҳ», деб айтишга буюрилдик», дедилар. \n" +
                        "(Маъноси: Аллоҳ нимани хоҳласа, бўлади. Аллоҳдан бошқада бирор қувват йўқ).\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                78,
                5,
                "Ёмғирнинг зараридан қўрқилганда",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Бир киши жума куни эшикдан кириб келди. Расулуллоҳ соллаллоҳу алайҳи васаллам ўшанда тик туриб хутба айтаётган эдилар. У: «Эй Аллоҳнинг расули, моллар ҳалок бўлиб, кўчалар ҳувиллаб қолди. Аллоҳга дуо қилинг, ёмғирни тўхтатсин», деди. Шунда Расулуллоҳ соллаллоҳу алайҳи васаллам икки қўлларини кўтариб: \n" +
                        "\n" +
                        "اللهُمَّ حَوَالِينَا وَلاَ عَلَيْنَا، اللهُمَّ عَلَى الآكَامِ وَالظِّرَابِ وَبُطُونِ الأَوْدِيَةِ وَمَنَابِتِ الشَّجَرِ\n" +
                        "\n" +
                        "«Аллоҳумма ҳавалийна ва ла ъалайна Аллоҳумма ъалал аками ваззироби ва бутунил авдийати ва манабитиш шажари» \n" +
                        "(Эй Раббим, атрофимизга ёғдир, устимиздан ёғдирма, эй Раббим, уни тепаликларга, тоғларга, водийларга, дарахтзорларга ёғдир), дедилар. Кейин ёмғир тўхтади, биз кўчага чиқдик ва қуёш нури остида юриб кетдик».\n" +
                        "\n" +
                        "Имом Бухорий ва Имом Муслим ривоятлари"
            ),
            PrayerText(
                79,
                5,
                "Ёмғир ёғаётганда ўқиладиган дуолар",
                "Аллоҳ таоло Қуръони Каримда ёмғирни зикр қилар экан, бундан кўзланган икки мақсадни айтиб ўтади. Оятларнинг бирида шундай дейилади:\n" +
                        "\n" +
                        "«У Ўз раҳмати (яъни ёмғир) олдидан хушхабар қилиб шамоллар юборган Зотдир» (Фурқон сураси, 48-оят).\n" +
                        "\n" +
                        "Бошқа оятда эса шундай дейилган:\n" +
                        "\n" +
                        "«Улар уни (азобни) ўз водийларига қараб келаётган бир қора булут ҳолида кўришгач, «Бу бизларга ёмғир келтиргувчи булутдир», – дедилар. (Ҳуд айтди)«Йўқ, у ўзларингиз шоштирган нарса – бир бўронки, унда аламли азоб бордир» (Аҳқоф сураси, 24-оят).\n" +
                        "\n" +
                        "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "«Расулуллоҳ соллаллоҳу алайҳи васалламнинг замонларида Мадина аҳлига қурғоқчилик етди. У зот жума куни хутба қилаётган эдилар, бир киши туриб, «Эй Аллоҳнинг Расули, чорва ҳалок бўлди, қўйлар ҳалок бўлди. Аллоҳга дуо қилинг, ёмғир юборсин» деди. У зот қўлларини кўтариб, дуо қилдилар. Осмон шишадек тиниқ, мусаффо эди. Бирдан шамол туриб, булут пайдо бўлди. Булутлар тўплангач, осмон мешининг оғзини очиб юборди (шаррос ёмғир қуйиб юборди). (Масжиддан) чиқиб, уйларимизга етгунимизча сув кечиб бордик. Ёмғир кейинги жумагача тўхтамади. Ҳалиги одам яна у зотнинг ҳузурларига келиб, «Эй Аллоҳнинг Расули, уйлар йиқиляпти. Аллоҳга дуо қилинг, уни (ёмғирни) тўхтатсин», деди. Расулуллоҳ соллаллоҳу алайҳи васаллам табассум қилдилар, сўнг: «(Аллоҳим! Ёмғирни) атрофимизга (ёғдир), бизнинг устимизга эмас!» дедилар. Қарасам, булутлар Мадина атрофига тарқалиб, худди гулчамбардек бўлиб қолди», деди.\n" +
                        "\n" +
                        "Ёмғир ёққанда ўқиладиган дуо\n" +
                        "\n" +
                        "Ёмғир раҳмат ёки бало бўлиб келиши мумкин бўлгани сабабли Пайғамбаримиз соллаллоҳу алайҳи васаллам шамол бошланса, (ёмғир яқинлашиб келаётганининг аломати бўлгани учун) кайфиятлари ўзгариб, безовта бўла бошлардилар. «Нега хавотирга тушдингиз» деб сўрашса, ул зоти бобаракот: «Умматимга жазо келмадимикин деб қўрқаман», дея жавоб берардилар.\n" +
                        "\n" +
                        " Ёмғир ёға бошлаганда ул зот қуйидаги дуони ўқир эдилар:\n" +
                        "\n" +
                        "«Аллоҳумма, инний ас-алука хойроҳаа ва хойро маа фииҳаа, ва хойро маа урсилат биҳ, ва аъуузу бика мин шарриҳаа ва шарри маа фииҳаа ва шарри маа урсилат биҳ».\n" +
                        "\n" +
                        "Дуонинг маъноси: «Аллоҳим, Сендан бунинг (шамолнинг) яхшисини, ундаги яхшиликни ва у билан юборилган нарсанинг (ёмғирнинг) яхшисини сўрайман. Сендан унинг ёмонидан, ундаги ёмонликдан ва у билан юборилган нарсанинг ёмонидан паноҳ сўрайман».\n" +
                        "\n" +
                        " Пайғамбаримиз соллаллоҳу алайҳи васаллам ёмғир пайтида мана бу дуони ҳам ўқирдилар: «Аллоҳумма, ҳаваалайнаа ва лаа 'алайнаа».\n" +
                        "\n" +
                        "Дуонинг маъноси: «Аллоҳим, бу ёмғир атрофимизга ёғсин, устимизга ёғмасин» («Саҳиҳи Бухорий», «Саҳиҳи Муслим»).\n" +
                        "\n" +
                        "Ёмғир тингандан сўнг ўқиладиган дуо\n" +
                        "\n" +
                        "«Мутирнаа бифазли-ллааҳи ва роҳматиҳ».\n" +
                        "\n" +
                        "Дуонинг маъноси: «Аллоҳнинг фазли ва раҳмати ила ёмғир ёғди» («Саҳиҳи Бухорий» ва «Саҳиҳи Муслим»).\n" +
                        "\n" +
                        "Келтириб ўтилган ушбу дуолар ёмғир ёғаётганда ўқиладиган кўплаб дуолардан баъзилари, холос."
            ),
            PrayerText(
                80,
                5,
                "Ҳожат намозида",
                "Абдуллоҳ ибн Абу Авфо розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Ким Аллоҳ таолога ёки одам болаларидан бирортасига ҳожати бўлса, чиройли таҳорат олиб, икки ракат намоз ўқисин ва Аллоҳга сано, Расулуллоҳ соллаллоҳу алайҳи васалламга саловот айтиб, сўнг ушбу дуони ўқисин: \n" +
                        "\n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ الْحَلِيمُ الكَرِيْمُ سُبْحَانَ اللهِ رَبِّ العَرْشِ العَظِيمِ، الْحَمْدُ للهِ رَبِّ العَالَمِينَ أَسْأَلُكَ مُوجِبَاتِ رَحْمَتِكَ وَعَزَائِمَ مَغْفِرَتِكَ وَالغَنِيمَةَ مِنْ كُلِّ بِرٍّ وَالسَّلاَمَةَ مِنْ كُلِّ إِثْمٍ لاَ تَدَعْ لِي ذَنْبًا إِلاَّ غَفَرْتَهُ وَلاَ هَمًّا إِلاَّ فَرَّجْتَهُ وَلاَ حَاجَةً هِيَ لَكَ رِضًا إِلاَّ قَضَيْتَهَا يَا أَرْحَمَ الرَّاحِمِينَ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳул ҳалиймул карийм. Субҳаналлоҳи роббил ъаршил ъазийм. Алҳамду лиллаҳи роббил ъаламийн. Ас`алука мужибати роҳматика ва ъазоима мағфиротика вал ғониймата мин кулли биррин, вассаламата мин кулли исмин, ла тадаъ лий занбан илла ғофартаҳу ва ла ҳамман илла фаррожтаҳу ва ла ҳажатан ҳийа лака ризон илла қозайтаҳа йа арҳамар роҳимийн».\n" +
                        "(Маъноси: Ҳалим ва карим сифатли Аллоҳдан бошқа илоҳ йўқ. Улуғ арш рабби Аллоҳни поклаб ёд этаман. Оламлар рабби Аллоҳга ҳамд бўлсин. Раҳматингга мустаҳиқ бўладиган нарсани, мағфиратингни вожиб қиладиган нарсани, ҳар бир яхшиликда ғаниматни ва ҳар бир гуноҳдан саломат бўлишни сўрайман. Менда бирор гуноҳ қолдирмасдан мағфират қилишингни, бирор ғам қолдирмасдан очиб юборишингни ва Ўзинг рози бўладиган бирор ҳожат қолдирмасдан раво қилишингни сўрайман, эй раҳм қилгувчиларнинг Раҳмлиси.) \n" +
                        "\n" +
                        "Имом Термизий ва Ибн Можа ривоятлари."
            ),

            PrayerText(
                81,
                5,
                "Янги чиққан ойни кўрганда",
                "Талҳа ибн Убайдуллоҳ розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам янги чиққан  ойни кўрсалар:\n" +
                        " \n" +
                        "اللهُمَّ أَهِلَّهُ عَلَيْنَا بِاليُمْنِ وَالإِيْمَانِ وَالسَّلاَمَةِ وَالإسْلاَمِ رَبِّي وَرَبُّكَ اللهُ\n" +
                        "\n" +
                        "«Аллоҳумма аҳиллаҳу ъалайна билйумни вал иймани вассаламати вал ислам. Роббий ва Роббукаллоҳ», деб айтардилар. \n" +
                        "(Маъноси: Эй Аллоҳим, бизга бу ойни баракотли, иймон, саломатлик ва ислом ойи қил. (Эй ҳилол!) Менинг раббим ҳам, сенинг раббинг ҳам Аллоҳдир.) \n" +
                        "\n" +
                        "Имом Дорамий ва Термизий ривоятлари."
            ),
            PrayerText(
                82,
                5,
                "Ифтор пайтида",
                "Муоз ибн Зуҳра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам ифтор қилсалар: \n" +
                        "\n" +
                        "اللهُمَّ لَكَ صُمْتُ وَعَلَى رِزْقِكَ أَفْطَرْتُ\n" +
                        "\n" +
                        "«Аллоҳумма лака сумту ва ъала ризқика афторту», деб айтардилар».\n" +
                        "(Маъноси: Аллоҳим, Сен учун рўза тутдим ва Сен берган ризқ ила ифтор қилдим.)\n" +
                        "\n" +
                        "Абу Довуд мурсал ҳолатда ривоят қилганлар."
            ),
            PrayerText(
                83,
                5,
                "Қадр кечасида",
                "Оиша розияллоҳу анҳо: «Эй Расулуллоҳ (соллаллоҳу алайҳи васаллам), агар Лайлатул қадр, яъни қадр кечаси эканини билсам, нима деб айтаман», деб сўрадилар, шунда Расулуллоҳ соллаллоҳу алайҳи васаллам: \n" +
                        "\n" +
                        "اللهُمَّ إِنَّكَ عَفُوٌّ تُحِبُّ العَفْوَ فَاعْفُ عَنِّي\n" +
                        "\n" +
                        "«Аллоҳумма иннака ъафуввун, туҳиббул ъафва фаъфу ъанний», деб айт», дедилар. \n" +
                        "(Маъноси: Эй Раббим, Сен афв қилгувчисан ва афв қилишни яхши кўрасан. Мени афв эт.)\n" +
                        "\n" +
                        "Имом Термизий, Насаий, Ибн Можа ривоятлари."
            ),
            PrayerText(
                84,
                5,
                "Ҳаж учун эхромга кирганда",
                "Ким эҳром киймоқчи бўлса, аввал таҳорат олади, сўнг ғусл қилиб, изор ва ридосини кияди. Таҳорат, ғусл ва кийим кийишдаги дуоларни олдинги бобларда зикр қилдик, ўшаларни айтади. Кейин икки ракат намоз қийди. Биринчи ракатда «Қул йа аййуҳал кафирун»ни, иккинчи ракатида «Қул ҳуваллоҳу аҳад»ни ўқийди. Намоздаги зикрларни айтади. Намозни тугатганидан кейин хоҳлаганича дуо қилади. Агар эҳром кийишни хоҳласа, қалби билан ният қилиб, ушбу дуоларни ўқийди:\n" +
                        "«Наввайтул ҳажжа ва аҳрамту биҳи лиллаҳи азза ва жалла». \n" +
                        "(Маъноси: Ҳажни ният қилиб, Аллоҳ азза ва жалла йўлида эҳром кийдим.)\n" +
                        "Ёки: «Аллоҳумма инний урийдул ҳажжа файассирҳу лий ва тақоббалҳу минний».\n" +
                        "(Маъноси: Эй Раббим, ҳаж  қилишни хоҳлайман, уни менга осон қилиб, мендан қабул эт.)\n"
            ),
            PrayerText(
                85,
                5,
                "Талбия айтганда",
                "لَكَ\n" +
                        "\n" +
                        "«Лаббайкаллоҳумма лаббайк, лаббайка ла шарийка лака лаббайк, иннал ҳамда ванниъмата лака вал мулк, ла шарийка лак».\n" +
                        "(Маъноси: Лаббай, Аллоҳим, Сенга итоатдаман. Сенга итоатдаман. Сенинг шеригинг йўқ. Лаббай Сенга. Албатта, ҳамд, неъмат ва мулк Сеникидир. Сенинг шеригинг йўқ.)"
            ),
            PrayerText(
                86,
                5,
                "Кўзи Каъбага тушганда",
                "Каъбани кўрганда мусулмоннинг қилган дуоси ижобат қилинади, дейилган. Бунда ушбу дуо ўқилади:\n" +
                        "\n" +
                        "اللهُمَّ زِدْ هَذَا البَيْتَ تَشْرِيفًا وَتَعْظِيمًا وَتَكْرِيْمًا وَمَهَابَةً وَزِدْ مَنْ شَرَّفَهُ وَكَرَّمَهُ مِمَّنْ حَجَّهُ أَوْ اعْتَمَرَهُ تَشْرِيفًا وَتَكْرِيْمًا وَتَعْظِيمًا وَبِرًّا\n" +
                        "\n" +
                        "«Аллоҳумма зид ҳазал байта ташрийфан ва таъзийман ва такрийман ва маҳабатан ва зид ман шаррофаҳу ва карромаҳу мимман ҳажжаҳу ав иътамароҳу ташрийфан ва такрийман ва таъзийман ва биррон», дейди.\n" +
                        "(Маъноси: Эй Раббим, бу Уйнинг шарафини, улуғлигини, ҳурматини, ҳайбатини зиёда қил. Ва уни шарафлаган, ҳурматлаган, ҳаж қилган, умрани бажарган кишиларнинг шарафини, улуғлигини, яхшилигини зиёда эт).\n"
            ),
            PrayerText(
                87,
                5,
                "Байтуллоҳга кирганда",
                "Байтуллоҳга кирилганда қуйидаги дуони ўқиш яхши амалдир: \n" +
                        "«Аллоҳумма антас салам ва минкас салам ва илайка йаржиъус салам, ҳаййина роббана бис салам ва адхилна дарока дарос салам. Табарокта роббана ва таъалайта йа зал жалали вал икром».\n" +
                        "(Маъноси: Эй Аллоҳим, Сен саломсан, салом Сендандир. Салом Сенга қайтувчидир. Эй Раббимиз, бизни салом билан тирилтир, ҳовлинг бўлмиш салом ҳовлисига бизларни кирит. Эй Раббимиз, бизни баракотли ва олий қил. Сен улуғ ва ҳурматли зотсан.)"
            ),
            PrayerText(
                88,
                5,
                "Ҳажарул асвадни ушлаганда ва тавофнинг бошланишида",
                "\n" +
                        "بِسْمِ اللهِ وَاللهُ أَكْبَرُ اللهُمَّ إِيْمَانًا بِكَ وَتَصْدِيقًا بِكِتَابِكَ وَوَفَاءً بِعَهْدِكَ وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ\n" +
                        "\n" +
                        "«Бисмиллаҳи валлоҳи акбар, Аллоҳумма ийманан бика ва тасдийқон би китабика ва вафа`ан биъаҳдика ваттибаъан лисуннати набиййка соллаллоҳу алайҳи васаллам», деб, айтиш мустаҳаб амал.\n" +
                        "(Маъноси: Аллоҳ номи билан Уни улуғлаб, Эй Раббим, Сенга иймон келтириб, китобингни тасдиқлаб, аҳдингга вафо қилиб, Пайғамбарингнинг суннатига тобеъ бўлиб бошлайман.)\n"
            ),
            PrayerText(
                89,
                5,
                "Тавоф пайтида ",
                "Аввалги уч айланишда\n" +
                        "\n" +
                        "اللهُمَّ اجْعَلْهُ حَجًّا مَبْرُورًا وَذَنْبًا مَغْفُورًا وَسَعْيًا مَشْكُورًا\n" +
                        "\n" +
                        "«Аллоҳуммажъалҳу ҳажжан мабрурон ва занбан мағфурон ва саъйан  машкурон», дейди. \n" +
                        "(Маъноси: Аллоҳим, ҳажни қабул бўладиган, гуноҳни кечириладиган ва ҳаракатни мақталадиган қил.) \n" +
                        "Қолган тўрт айланишда:\n" +
                        "\n" +
                        "اللهُمَّ اغْفِرْ وَارْحَمْ وَاعْفُ عَمَّا تَعْلَمْ وَأَنْتَ الأَعَزُّ الأَكْرَمُ، اللهُمَّ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَقِنَا عَذَابَ النَّارِ\n" +
                        "\n" +
                        "«Аллоҳуммағфир варҳам ваъфу ъамма таълам ва антал аъаззул акром. Аллоҳумма роббана атина фиддунйа ҳасанатан ва фил ахироти ҳасанатан ва қина ъазабан нар», деб айтади. \n" +
                        "(Маъноси: Аллоҳим, мағфират қил, раҳм айла, билган нарсаларингни афв эт. Сен азиз ва карамли зотсан. Эй Раббим, дунёю охиратда бизга яхшилик бер ва бизни дўзах азобидан сақла.)\n" +
                        "Уламолар: «Тавофда айтиладиган нарсаларни энг яхшиси «Аллоҳумма роббана атина фиддунйа ҳасанатан ва фил ахироти ҳасанатан ва қина ъазабан нар», дейишган."
            ),
            PrayerText(
                90,
                5,
                "Арафотда турганда",
                "Расулуллоҳ соллаллоҳу алайҳи васаллам айтдилар:\n" +
                        "«Дуоларнинг энг яхшиси арафа кунидагисидир. Мен ва мендан олдинги пайғамбарлар айтган нарсаларнинг энг яхшиси:\n" +
                        "\n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу лаҳул мулку ва лаҳул ҳамду ва ҳува ъала кулли шай`ин қодийр»дир».\n" +
                        "Али розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам арафа куни ўша жойда: \n" +
                        "\n" +
                        "اللهُمَّ لَكَ الْحَمْدُ كَالَّذِي نَقُولُ وَخَيْرًا مِمَّا نَقُولُ؛ اللهُمَّ لَكَ صَلاَتِي وَنُسُكِي وَمَحْيَايَ وَمَمَاتِي وَإِلَيْكَ مَآلِي وَلَكَ رَبِّ تُرَاثِي؛ اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ القَبْرِ وَوَسْوَسَةِ الصَّدْرِ وَشَتَّاتِ الأَمْرِ؛ اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ مَا تَجِيءُ بِهِ الرِّيحُ\n" +
                        "\n" +
                        "«Аллоҳумма лакал ҳамду каллазий нақулу ва хойрон мимма нақулу, Аллоҳумма лака солати ва нусукий ва маҳйайа ва маматий ва илайка маалий ва лака робби туросий, Аллоҳумма инний аъузу бика мин ъазабил қобри ва васвасатис содри ва шаттотил амри, Аллоҳумма инний аъузу бика мин шарри ма тажий`у биҳиррийҳу», деб кўп айтар эдилар».\n" +
                        "(Маъноси: Аллоҳим, айтган нарсаларимизда ва айтган нарсаларимизнинг яхшисида Сенга ҳамд бўлсин. Эй Раббим, намозим, ҳажим, ҳаёту мамотим Сен учундир. Оқибатим ва меросим ҳам Сенгадир. Эй Раббим, Сендан қабр азобидан, қалб васвасасидан ва ишлар ҳар турли бўлиб кетишидан паноҳ тилайман. Аллоҳим, Сендан номинг ила шамол олиб келадиган ёмонликдан ҳам паноҳ сўрайман.) \n" +
                        "\n" +
                        "Имом Термизий ривоятлари.\n" +
                        "\n" +
                        "Арафа куни ҳожилар Пайғамбаримиз  айтган ушбу дуони кўп такрорлашади, орада талбия ва бошқа  дуоларни ҳам айтишади, бунда ҳам ихтиёр қилинган дуо «Роббана атина фид дунйа ҳасанатан ва фил ахироти ҳасанатан ва қина ъазабан нар»дир."
            ),
            PrayerText(
                91,
                5,
                "Зам-зам сувини ичганда",
                "Ибн Аббос розияллоҳу анҳу агар Замзам сувини ичсалар:\n" +
                        " \n" +
                        "اللهُمَّ إنِّي أَسْألُكَ عِلْمًا نَافِعًا وَرِزْقًا وَاسِعًا وَشِفَاءً مِنْ كُلِّ دَاءٍ\n" +
                        "\n" +
                        "«Аллоҳумма инний ас`алука ъилман нафиъан ва ризқон васиъан ва шифаан мин кулли даин», деб айтардилар.\n" +
                        "(Маъноси: Аллоҳим, мен Сендан фойдали илм, кенг ризқ ва ҳар дардга шифо беришингни сўрайман.)\n" +
                        "\n" +
                        "Имом Ҳоким ривоятлари."
            ),
            PrayerText(
                92,
                5,
                "Улов (машина ва шунга ўхшаш нарсалар)га минаётганда",
                "Али ибн Рабийъадан ривоят қилинади:\n" +
                        "Али ибн Абу Толиб розияллоҳу анҳу отларини мингани келиб, оёқларини уловга қўйганларида «Бисмиллаҳ», дедилар. Қачонки, унинг устига ўрнашганларида\n" +
                        "\n" +
                        "الْحَمْدُ للهِ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إلَى رَبِّنَا لَمُنْقَلِبُونَ\n" +
                        "\n" +
                        "«Алҳамду лиллаҳиллазий саххара лана ҳаза ва ма кунна лаҳу муқринийн ва инна ила роббина ламунқолибун», деб айтдилар.\n" +
                        "(Маъноси: «Бизга буларни бўйсундириб қўйган Зотга ҳамд бўлсин. Бизлар ўзимиз бунга қодир эмас эдик. Барчамиз Парвардигоримизга қайтувчидирмиз».)"
            ),
            PrayerText(
                93,
                5,
                "Сафарга чиқишни хоҳлаганда",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам сафарни хоҳлаб ўринларидан турадиган бўлсалар,\n" +
                        " \n" +
                        "اللهُمَّ إِلَيْكَ تَوَجَّهْتُ، وَبِكَ اعْتَصَمْتُ؛ اللهُمَّ اكْفِنِي مَا هَمَّنِي وَمَا لاَ أَهْتَمُّ لَهُ، اللهُمَّ زَوِّدْنِي التَّقْوَى، وَاغْفِرْ لِي ذَنْبِي وَوَجِّهْنِي للخَيْرِ أَيْنَمَا تَوَجَّهْتُ\n" +
                        "\n" +
                        "«Аллоҳумма илайка таважжаҳту ва бика иътасамту, Аллоҳумма икфиний ма ҳамманий ва ма ла аҳтамму лаҳу, Аллоҳумма заввидний тақво вағфирлий занбий ва важжиҳний лил хойри айнама таважжаҳту», деб айтардилар.\n" +
                        "(Маъноси: «Эй Раббим, Сенга юзланиб, Сенга илтижо қиламан. Эй Раббим, мени ташвишга солган ва аҳамият бермаган нарсамдан ўзинг кифоя қил. Эй Раббим, тақвоимни зиёда қил. Ва гуноҳларимни кечиргин. Қаерда юзлансам, яхшиликка юзлантир».)\n" +
                        "\n" +
                        "Табароний ривоятлари."
            ),
            PrayerText(
                94,
                5,
                "Сафарга чиқаётганда",
                "Абдуллоҳ ибн Умар розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам сафарга чиқадиган бўлиб, уловларига ўрнашиб олганларидан кейин уч марта такбир айтар, сўнгра\n" +
                        " \n" +
                        "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِيْنَ، وَإِنَّا إلَى رَبِّنَا لَمُنْقَلِبُونَ. اللهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا البِرَّ وَالتَّقْوَى وَمِنَ العَمَلِ مَا تَرْضَى، اللهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِعَنَّا بُعْدَهُ. اللهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَرِ وَالْخَلِيْفَةُ فِي الأَهْلِ. اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ وَكَآبَةِ الْمَنْظَرِ وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالأَهْلِ \n" +
                        "\n" +
                        "«Субҳаналлазий саххора лана ҳаза ва ма кунна лаҳу муқринийн ва инна ила роббина ламунқолибун. Аллоҳумма инна насъалука фий сафарина ҳаза ал-бирро ваттақва ва минал ъамали ма тарзо, Аллоҳумма ҳаввин ъалайна сафарана ҳаза ватви ъанна буъдаҳу, Аллоҳумма антас соҳибу фиссафари валхалийфату фил аҳли. Аллоҳумма инний аъузу бика мин ваъсоис сафари ва каобатил манзари ва сув‘ил мунқолаби фил мали вал аҳли», деб айтардилар.\n" +
                        "(Маъноси: «Бизларга бу (кема ёки от-улов)ни бўйсундириб қўйган Зот (яъни, Аллоҳ барча айбу нуқсондан) покдир. Биз ўзимиз бунга қодир эмас эдик. Шак-шубҳасиз, бизлар (барчамиз) Раббимизга қайтгувчидирмиз. Аллоҳим, Сендан бу сафаримизда яхшилик ва тақвони ҳамда Сен рози бўладиган амални сўраймиз. Аллоҳим, бу сафаримизни бизга енгил қилиб, узоқлигини яқин қилгин. Аллоҳим, сафардаги йўлдош ҳам, хонадонда қолувчи ўринбосар ҳам ўзингдирсан. Аллоҳим, мен Сендан сафар машаққатларидан, маҳзунлик манзараси ва молу-мулк, оилага етадиган зиён-заҳматдан паноҳ беришингни сўрайман».)"
            ),
            PrayerText(
                95,
                5,
                "Сафардан қайтганда",
                "Агар сафардан қайтсалар, юқоридаги дуони айтиб, қуйидагиларни қўшимча қилардилар:\n" +
                        "\n" +
                        "آيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُونَ\n" +
                        "\n" +
                        "«Ойибуна, тоибуна, обидуна, лироббина ҳамидуна».\n" +
                        "(Маъноси: «(Биз) қайтувчи, тавба қилувчи, ибодат қилувчи ва Раббимизга ҳамд айтувчилармиз».)\n" +
                        "\n" +
                        "Имом Муслим ривоятлари.\n" +
                        "\n" +
                        "Абу Довуд ривоятларида эса: «Расулуллоҳ соллаллоҳу алайҳи васаллам ва аскарлари агар баландликка кўтарилишса, такбир, агар пастликка тушишса, тасбеҳ айтишар эди» қўшимчаси келтирилган."
            ),
            PrayerText(
                96,
                5,
                "Ҳайвон қочиб қолганда",
                "Абдуллоҳ ибн Масъуд розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Агар сизлардан бирингизнинг улови чўлда ечилиб қочиб кетса,\n" +
                        " \n" +
                        "يَا عِبَادَ اللهِ احْبِسُوا، يَا عِبَادَ اللهِ احْبِسُوا\n" +
                        "\n" +
                        "«Йаа ибадаллоҳ аҳбису я ибадаллоҳ аҳбису» (яъни, эй Аллоҳнинг бандалари, ушланглар), деб айтсин. Чунки Аллоҳнинг ерда тўсувчилари бордир. Ўшалар уни ушлаб беришади», дедилар.\n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                97,
                5,
                "Бирор манзилга тушганда",
                "Хавла бинти Ҳаким розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки бир манзилга тушиб;\n" +
                        " \n" +
                        "أَعُوذُ بِكَلِمَاتِ اللهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ\n" +
                        "\n" +
                        "«Аъузу бикалиматиллаҳит таммати мин шарри ма холақ», деб айтса, то бошқа манзилга кўчгунича бирор нарса зарар етказа олмайди», деб айтдилар.\n" +
                        "(Маъноси: «Аллоҳимнинг ҳамма калималари билан У яратган нарсаларнинг ёмонлигидан паноҳ тилайман».)\n" +
                        "\n" +
                        "Имом Муслим, Молик ва Термизийлар ривояти.\n" +
                        "\n" +
                        "Абдуллоҳ ибн Умар ибн Хаттоб розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам агар сафар қилсалар, ана шу куни кечаси\n" +
                        "\n" +
                        " يَا أَرْضُ رَبِّي وَرَبُّكِ اللهُ، أَعُوذُ بِاللهِ مِنْ شَرِّكِ وَشَرِّ مَا فِيْكِ، وَشَرِّ مَا خُلِقَ فِيْكِ، وَشَرِّ مَا يَدِبُّ عَلَيْكِ؛ أَعُوذُ بِكَ مِنْ أَسَدٍ وَأَسْوَدَ، وَمِنَ الْحَيَّةِ وَالعَقْرَبِ، وَمِنْ سَاكِنِ البَلَدِ وَمِنْ وَالِدٍ وَمَا وَلَدَ\n" +
                        "\n" +
                        "«Йа арзу роббий ва роббукиллаҳу, аъузу биллаҳи мин шаррики ва шарри ма фийки, ва шарри ма хулиқо фийки, ва шарри ма йадиббу ъалайки, Аъузу бика мин асадин ва асвада ва минал ҳаййати вал ъақраби ва мин сакинил балади ва мин волидин вама валада», деб айтардилар. \n" +
                        "(Маъноси: «Эй ер, менинг ва сенинг Раббинг Аллоҳдир. Аллоҳнинг номи билан сенинг ёмонлигингдан, сендаги ёмонликдан, сенда халқ қилинган ёмонликдан, сенда судралиб юрадиганларнинг ёмонлигидан паноҳ тилайман. Ва яна шердан, кишилардан, илондан, чаёндан, ерда яшовчи жинлардан, иблис ҳамда шайтондан паноҳ тилайман».)\n" +
                        "\n" +
                        "Абу Довуд ривоятлари."
            ),
            PrayerText(
                98,
                5,
                "Мажлисдан турганда",
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Кимки бир мажлисда ўтирганида бефойда нарса кўпайиб кетса, мажлисдан туришидан олдин\n" +
                        " \n" +
                        "سُبْحَانَكَ اللهُمَّ وَبِحَمْدِكَ أَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ أَنْتَ أَسْتَغْفِرُكَ وَأَتُوبُ إِلَيْكَ\n" +
                        "\n" +
                        "«Субҳанакаллоҳумма ва биҳамдика ашҳаду анла илаҳа илла анта астағфирука ва атубу илайка», деб айтса, ана шу мажлисда содир бўлган гуноҳлари кечирилади», дедилар.\n" +
                        "(Маъноси: «Аллоҳим, Сенга ҳамд айтиш ила Сени поклаб ёд этаман. Гувоҳлик бераманки, Сендан бошқа илоҳ йўқ. Сенга истиғфор айтиб тавба қиламан».)\n" +
                        "\n" +
                        "Имом Термизий ривоятлари."
            ),
            PrayerText(
                99,
                5,
                "Бозорга кирганда",
                "Имом Ҳоким Бурайда розияллоҳу анҳудан қилган ривоятларида:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам бозорга кирсалар:\n" +
                        "\n" +
                        "بِسْمِ اللهِ اللهُمَّ إِنِّي أَسْأَلُكَ خَيْرَ هَذِهِ السُّوقِ وَخَيْرَ مَا فِيْهَا وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ مَا فِيْهَا؛ اللهُمَّ إِنِي أَعُوذُ بِكَ أَنْ أُصِيْبَ فِيْهَا يَمِيْنًا فَاجِرَةً أَوْ صَفْقَةً خَاسِرَةً\n" +
                        "\n" +
                        "«Бисмиллаҳи, Аллоҳумма инний ас‘алука хойра ҳазиҳис сувқи ва хойра ма фийҳа ва ауъзу бика мин шарриҳа ва шари ма фийҳа. Аллоҳумма инний ауъзу бика ан усийба фийҳа ямийнан фажира ав сафқатан хосира», деб айтдилар.\n" +
                        "(Маъноси: «Аллоҳнинг исми ила. Аллоҳим, Сендан бу бозорнинг яхшисини ва ундаги яхшиликларни сўрайман. Ва бу бозорнинг ёмонидан ҳамда ундаги ёмонликдан Сенинг номинг ила паноҳ тилайман. Аллоҳим, Сенинг номинг ила гуноҳга элтувчи қасамдан ва зарар келтирувчи битимдан паноҳ сўрайман».)\n"
            ),

            PrayerText(
                100,
                5,
                "Ҳазрат Абу Бакр (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Менга имон, сидқидиллик, соғлиқ, офият ва соғлом бир ният бер.\n" +
                        "\n" +
                        "Ё Аллоҳ! Умримнинг охирини энг хайрлиси, амалимнинг ниҳоясининг хайрлиси ва Сенинг жамолингни кўрадиган кунимни кунларимнинг энг хайрлиси қил!"
            ),
            PrayerText(
                101,
                5,
                "Ҳазрат Умар (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Мени ногаҳон ўлимдан ё ғафлатда қолдиришинг ёки ғофиллардан қилишингдан асрашингни сўрайман.\n" +
                        "\n" +
                        "Ё Аллоҳ! Мени яхшилар орасида ўлдир,\n" +
                        "ёмонлардан қилма, оташ азобидан асра ва яхшилар қаторига қўшгин."
            ),
            PrayerText(
                102,
                5,
                "Ҳазрат Али (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Бало ва мусибатлардан, омадсизликдан, душманлар билан тортишишдан, ҳибс этилишдан, кишанланишдан ва калтакланишдан мени асра.\n" +
                        "\n" +
                        "Ё Аллоҳ! Менинг гуноҳларим Сенга зарар қилмайди. Сенинг менга марҳамат қилишинг Сенинг марҳаматингни камайтирмайди.\n"
            ),
            PrayerText(
                103,
                5,
                "Абдуллоҳ ибн Масъуд (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Сендан ўзгармас кучли имон, туганмас неъмат ва хулд жаннатининг энг юқори даражасида Пайғамбаринг билан бирга қилишингни сўрайман.\n" +
                        "\n" +
                        "Эй Раббимиз! Келишолмаганларимизни яраштир, бизни Ислом йўлига ҳидоят айла, бизни зулматдан ёруғликка чиқар. Биздан ошкор ва яширин барча ёмонликларни кетказ. Кўзларимизга, қулоқларимизга, қалбларимизга, ишларимизга, аёлларимизга ва фарзандларимизга барака ато айла, гуноҳларимизни кечир. Шубҳасиз, Сен марҳаматли ва гуноҳларни кечиргувчисан. Бизни неъматингга шукр этувчи, ҳамд айтувчи қил ва неъматингни биздан аяма! («Ал-Канз», «Ал Мунтаҳаб»дан.)"
            ),
            PrayerText(
                104,
                5,
                "Абдураҳмон ибн Авф (розияллоҳу анҳу) дуоси",
                "Абу Ҳайёж Асадий (розияллоҳу анҳу) дан:\n" +
                        "«Бир куни Байтуллоҳни тавоф қилаётган бир одамнинг тинимсиз: «Ё Аллоҳ! Мени нафсимнинг очкўзлиги (тамагирлиги)дан асра!» дея дуо\n" +
                        "қилаётганини кўрдим. Унга яқинлашиб дедим: – Аллоҳдан шундан бошқа сўрайдиган нарсанг йўқми? Фақат бир дуони қайтаряпсан?\n" +
                        "– Агар нафсимнинг очкўзлигидан (тамагирлигидан) сақлансам, на ўғрилик, на зино ва на бирор гуноҳ қиламан, – деди. Қарасам, у одам Абдураҳмон ибн Авф (розияллоҳу анҳу) экан (Тафсири Ибн Касирдан)"
            ),
            PrayerText(
                105,
                5,
                "Ҳазрат Билол (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Менинг ёмонликларим ва нуқсонларимни кечиргин."
            ),
            PrayerText(
                106,
                5,
                "Абу Дардо (розияллоҳу анҳу) дуоси",
                "Билол ибн Саъд (розияллоҳу анҳу) дан: Абу Дардо (розияллоҳу анҳу) дер эди: Ё Аллоҳ! Хаёл тарқоқлигидан асрашингни сўрайман. \n" +
                        "\n" +
                        "“Хаёл тарқоқлиги нима?”, дея сўрашди. \n" +
                        "“Кишининг ҳар бир дарада бир мулки бўлишидир”, дея жавоб берди у.\n" +
                        "\n" +
                        "Ё Аллоҳ! Олимларнинг қалблари менга лаънат ўқишидан паноҳ сўрайман, дея дуо қилган Абу Дардодан сўрашди:\n" +
                        "“Олимларнинг қалбларининг лаънат ўқиши қандай бўлади?”\n" +
                        "“Менга нисбатан нафрат этишларидир”, деди Абу Дардо.\n"
            ),
            PrayerText(
                107,
                5,
                "Зайд ибн Собит (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Сендан бола-чақам ва қўл остимда менга қараб қолган қулларимни боқишга етгулик бойлик сўрайман. Ва бирор қариндошимнинг қариндошлик ҳақини адо этолмаганим учун мени баддуо қилишидан паноҳ тилайман."
            ),
            PrayerText(
                108,
                5,
                "Саъд ибн Убода (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Сенга ҳамд айтишни менга насиб эт."
            ),
            PrayerText(
                109,
                5,
                "Ибн Аббос (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Мени берган ризқингга қаноат этгувчилардан айла, менга берган ризқни баракотли қил ва орқада қолдирган ҳар нарсамни Ўзинг асра."
            ),
            PrayerText(
                110,
                5,
                "Анас (розияллоҳу анҳу) дуоси",
                "Ё Аллоҳ! Уни (мусулмон биродаримни) кечалари ибодат қилувчи ва кундузлари рўзадор кишилар дуосининг баракотидан маҳрум этма."
            ),
            PrayerText(
                111,
                5,
                "Дуо қабул бўлишининг сабаблари",
                "1.Ихлос.\n" +
                        "\n" +
                        "Ихлос нафақат дуода, балки бошқа ибодатларда ҳам қабул бўлиши учун қўйилган асосий сабаб ҳисобланади. Айниқса, дуо қилиш вақтида ихлос бўлиши янада зарур. Қалбдан отилиб чиқмаган дуонинг ижобат бўлиши қийин.Ихлос бўлиши учун улуғ ва атоқли бўлиш шарт эмас. Оддий ва камкўрим кишиларнинг ихлос билан қилган дуолари уларникига қараганда мақбул ва ижобат бўлиши кўп кузатилган. Бунга мисол келтирсак, янада тушунарлироқ бўларди. \n" +
                        "\n" +
                        "Муҳаммад ибн Сувайд шундай ҳикоя қилади: “Мадинада қурғоқчилик бўлди. Шаҳар аҳли қийналиб қолди. Мадина аҳли эътибор бермайдиган масжиди набавийя мулозими бўлган бир киши бор эди. Мадина аҳли ёмғир сўраб дуо қилиб турганларида эски-туски, жулдур кийинган бир киши келиб, лўнда ва қисқа қилиб, икки ракат намоз ўқигандан кейин қўлини очиб шундай дуо қилди: “Эй Роббим, сенга қасам ичиб айтаманки, албатта ҳозир устимизга ёмғир ёғдирасан”, деди. Ҳали қўлини туширмасдан, дуосини тугатмай туриб осмонни қора булут қоплаб, ёмғир қуя бошлади. Ҳатто Мадина аҳли сел бўлиб оқаётган ёмғирга ҳарқ бўлишдан қўрқиб қичқирарди. Яна у: “Эй Роббим, агар уларга кифоя этганини билсанг, улардан ёмғирни кўтар”, деди. Ёмғир тинди. Бир киши ёмғир сўраб дуо қилган кишининг ортидан бориб, қаерда яшашини билди. Сўнг тонг отгандан кейин унинг олдига бориб: “Олдинга бир ишга келдим”, деди. У: “Нима экан айтавер”, деди. “Менга ҳам дуо қилишни ўргат”, деди. У: “Субҳаналлоҳ! Сен нималар деяпсан? Мендан дуони ўргатишимни сўраяпсанми”, деди ҳайрон бўлиб. Сўнг деди: “Сен кўриб турганингдек, менда ортиқча ҳислат йўқ. Менга нимани буюрган ва қайтарган бўлса, шуни деб Аллоҳга итоат қилдим. Бас, Аллоҳдан сўраган эдим, У мнинг дуоларимни ижобат қилди ”.\n" +
                        "\n" +
                        "2. Ижобат бўлишига ишониш.\n" +
                        "\n" +
                        "Дуо қилувчи киши ихлос билан дуо қилиши ва дуоси ижобат бўлишига чин кўнгилдан ишониши лозим. Бир нарсани сўрайдиган киши албатта чин қалбдан сўраса, албатта Аллоҳ таоло дуога очилган қўлини қуруқ қайтармайди. Зеро, мана бу ҳадисда ихлоссиз қилинган дуо ижобат бўлмаслиги айтиб ўтилган:  Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "\n" +
                        "Расулуллоҳ саллоллоҳу алайҳи ва саллам: «Аллоҳ қилган дуоингизни қабул қилишига ишонган ҳолингизда дуо қилинг. Ва шуни билингки, Аллоҳ ғофил ва бепарво қалбдан дуони қабул қилмайди». \n" +
                        "\n" +
                        "Имом Термизий ривояти.\n" +
                        "\n" +
                        "Иккиланиш ва тараддуд билан қилинган дуонинг ижобат бўлиши мушкул.\n" +
                        "\n" +
                        "3. Луқманинг ҳалоллигига эътибор бериш.\n" +
                        "\n" +
                        "Оламлар Роббиси қилган дуойимнинг қабул қилсин, деган ҳар бир мўмин шариатимизда ҳаром қилинган нарсалардан ўзини сақлаши лозим. Бу ҳақда ҳадисда қуйидагилар айтилган:\n" +
                        "\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "“Росулуллоҳ саллоллоҳу алайҳи ва саллам: Эй одамлар! Албатта Аллоҳ покдир ва фақат пок нарсанигина қабул этади. Аллоҳ пайғамбарларига нимани буюрган бўлса, мўминларга ҳам ўша нарсани буюргандир. Аллоҳ бу ҳақда: “Эй пайғамбарлар, ҳалол-пок таомлардан енглар ва яхши амаллар қилинглар!” ва яна “Эй пайғамбарлар, ҳалол-пок таомлардан енглар ва яхши амаллар қилинглар!” деб айтган”, дедилар.\n" +
                        "Сўнгра Росулуллоҳ саллоллоҳу алайҳи ва саллам (ҳаж ва шунга ўхшаш ибодат учун) узоқ сафар қилиб, сочлари тўзғиб, усти ғубор бўлиб кетган кишини зикр қилдилар. У: “Эй Роббим! Эй Роббим!”, деб дуо қилади. Лекин еяётган овқати ҳаром, ичимлиги ҳаром, кийими ҳаром ва ўсиб-улғайиши ҳаром. Қандай қилиб унинг дуоси қабул бўлсин” дедилар.\n" +
                        "\n" +
                        "Имом Муслим ривояти.\n" +
                        "\n" +
                        "4. Аллоҳга ҳамду сано ва Расулуллоҳ саллоллоҳу алайҳи ва салламга саловот айтиш билан дуони бошлаш ва тугатиш.\n" +
                        "\n" +
                        "Абдуллоҳ розияллоҳу анҳудан ривоят қилинади: “Намоз ўқиётган эдим, Набий саллоллоҳу алайҳи ва саллам Абу бакр ва Умар розияллоҳу анҳулар билан бирга эдилар. Ўтирганимда Аллоҳга ҳамду сано ва Набий саллоллоҳу алайҳи ва салламга саловот айтиш билан бошладим, кейин ўзимга дуо қилдим. Шунда Расулуллоҳ саллоллоҳу алайҳи ва саллам: “Сўра, сўраганинг берилади. Сўра, сўраганинг берилади” дедилар”.\n" +
                        "\n" +
                        "Термизий ривояти.\n" +
                        "\n" +
                        "5. Дуо қилаётганда шошилмаслик.\n" +
                        "\n" +
                        "Зеро, дуо қилиш барча ҳожатларни раво қиладиган Зотга юзланиб барча ҳожатларини сўраш деганидир. Аммо ўз ҳожатларини сўраганда, уни ижобат этадиган Зотга шошқалоқлик билан дуо қилинмайди.\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади: “Росулуллоҳ саллоллоҳу алайҳи ва саллам: “Сизнинг бирингиз шошқалоқлик қилмаса, дуоси ижобат бўлади. Унинг дуодаги шошқалоқлиги – дуо қилган эдим, ижобат бўлмади ёки бўлмаяпти, дейишидир”, дедилар”.\n" +
                        "\n" +
                        "6. Шариатда руҳсат этилган тавассулни қилиб дуо қилиш.\n" +
                        "\n" +
                        "Тавассаул – васила қилиш, яъни бирор ёмонликни даф этиш ёки яхшиликни жалб қилиш учун Аллоҳга илтижо этганда Аллоҳга яқин бандаларни ёки қилган яхши амалини васила қилиб дуо қилишдир. Саҳиҳ ҳадисда келишича, ғорга беркиниб қолган уч киши ундан чиқиб кетиши учун қилган солиҳ амалларини васила қилиб, Аллоҳга дуо қилганлари ва дуолари ижобат бўлиб, ғордан чиқиб кетганлари айтилган. \n" +
                        "\n" +
                        "Пайғамбаримиз саллоллоҳу алайҳи ва саллам умматларига таълим бериб қуйидаги дуоларни қилишга буюрганлар: Абу Саъид ал-Худрий розияллоҳу анҳудан ривоят қилинади:\n" +
                        "“Росулуллоҳ саллоллоҳу алайҳи ва саллам: “Кимки уйидан масжидга чиқса ва Аллоҳим, мен сендан сўровчилар ҳаққи-ҳурмати, (масжид сари) мана шу юришим ҳаққи-ҳурматидан  сўрайман. Зеро, мен кибрланиб, манмансираб ва риё-сумъа қилиб чиққаним йўқ. Мен сенинг ғазабинга дучор бўлишдан сақланиш ва розилигингга  эришиш учун чиқдим. Аллоҳим, мени дўзаҳдан асраб, гуноҳларимни кечиришингни сўрайман. Зеро, сендан бошқа ҳеч ким гуноҳларни кечирмас” деса, Аллоҳ унга юзи билан келади ва етмиш минг фаришта унинг ҳаққига истиғфор айтади” дедилар.\n" +
                        "\n" +
                        "Ибн Можжа ривояти.\n" +
                        "\n" +
                        "7. Фаровонлик ва ҳотиржамлик пайтларида кўпроқ дуо қилиш.\n" +
                        "\n" +
                        "Чунки инсон бошига машаққат ва қийинчилик тушганда Аллоҳга дуо қилиши табиий ҳолат. Аммо фаровонлик ва ҳеч нарсага муҳтожлик сезмаган пайтда камдан-кам одамлар дуо қилишади. Лекин ким мана шунақа тўқчилик пайтида дуо қилса, албатта Аллоҳ унинг дуосини ижобат қилар экан. Дуоси ижобат бўлганига асосий сабаб у ночорликда ҳам, фаровонликда ҳам ҳамиша Аллоҳга муҳтожлигини ҳис қилиб, дуо қилиб юрганидадир. Имом Термизий ривоят қилган ҳадисда бу ҳақда шундай дейилган: \n" +
                        "\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "“Росулуллоҳ саллоллоҳу алайҳи ва саллам: машаққат ва қийинчилик пайтда дуоси ижобат бўлиши кимни қувонтирса, фаровонлик пайтида кўпроқ дуо қилсин”, дедилар. \n" +
                        "\n" +
                        "Имом Термизий ривояти.\n" +
                        "\n" +
                        "8. Алолоҳдан гуноҳ ишни қилишга ва қариндошлар билан риштани узишга муваффақ қилишини  сўраб дуо қилмаслиги лозим.\n" +
                        "\n" +
                        "Имом Муслим ривоят қилган ҳадисда бу ҳақда шундай дейилади:\n" +
                        "\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади: Росулуллоҳ саллоллоҳу алайҳи ва саллам:\n" +
                        "“Модомики банда Аллоҳдан гуноҳ ишни қилишга ёки қариндошлар билан риштани узишга дуо қилмас, унинг дуолари ижобат бўлишида давом этади”, дедилар. \n" +
                        "\n" +
                        "Имом муслим ривояти.\n" +
                        "\n" +
                        "9. Дуо ижобат бўладиган ҳолатлар, соатлар ва маконларда дуо қилиши.\n" +
                        "\n" +
                        "Кун, ҳафта, ой ва йил давомида шунақа вақтлар борки, мўмин банда ўша соатларда дуо, унинг дуоси шак-шубҳасиз ижобат бўлади. Дуо ижобат бўладиган ҳолатларга мусофирлик, мазлум бўлиб дуо қилиш каби ҳолатларни келтиришим мумкин.  Шунингдек, дуо ижобат бўладиган маконлар ҳам бор. Ким ўша маконда туриб дуо қилса, дуоси ижобат бўлади.  Мисол учун, Арафа тоғи.\n" +
                        "\n" +
                        "10. Аллоҳнинг гўзал исм ва сифатларини айтиб дуо қилиш.\n" +
                        "\n" +
                        "Бу ҳақда Қуръонда шундай дейилади:\n" +
                        "\n" +
                        "وَلِلَّهِ ٱلْأَسْمَآءُ ٱلْحُسْنَىٰ فَٱدْعُوهُ بِهَا\n" +
                        "\n" +
                        "“Аллоҳнинг чиройли исмлари бордир. Унга ўша исмлар билан дуо қилингиз!” (Аъроф сураси 180-оят).\n" +
                        "\n" +
                        "Аллоҳнинг чиройли исмлари билан дуо қилиш унинг ижобат бўлишини таъминлайди. Хусусан, Аллоҳнинг Исми Аъзам деб номланган исмини айтиб дуо қилиш. Бу ҳақда ҳадисда шундай дейилган:\n" +
                        "\n" +
                        "Абдуллоҳ ибн Бурайда розияллоҳу анҳу оталаридан ривоят қилади:\n" +
                        "“Росулуллоҳ саллоллоҳу алайҳи ва саллам бир кишининг “Аллоҳим! Мен сендан сўрайман. Мен сенинг Аллоҳ эканингга, Сендан ўзга илоҳ йўқлигига, сенинг Аҳаду Сомадлигингга, туғмаган ва туғилмаган ҳамда тенги йўқ Зот эканингга гувоҳлик келтираман” деганини эшитиб: “Батаҳқиқ, Аллоҳдан сўралса, берадиган ва дуо қилинса, ижобат қиладиган исм ила сўрадинг”, дедилар”\n" +
                        "\n" +
                        "Термизий ривояти.\n" +
                        "\n" +
                        "11. Мусулмон биродарининг ҳақига ўзи бўлмаганда дуо қилиш.\n" +
                        "\n" +
                        "Мўмин биродарлари ҳақига дуо қилиш, хусусан ота-она , солиҳ кишилар, уломолар, обидлар, салоҳиятли мусулмонлар, заиф ва мазлум мусулмонлар ҳақига дуо қилиш.\n" +
                        "\n" +
                        "Савфон розияллоҳу анҳудан ривоят қилинади: “Шомга бордим. Абу Дардонинг уйига бориб уни топмадим. Умму Дардони кўрдим. У менга: “Бу йил ҳаж қилмоқчимисан?” деди. Мен “Ҳа”, дедим. У: “Бизга яхшилик сўраб, дуо қил. Набий соллоллоҳу алайҳи ва саллам: “Мусулмон кишининг ўз биродарига ғойибдан қилган дуоси мустажобдир. Унинг бошида бир муваккал фаришта туради. У ўз биродарига ҳар сафар яхшилик тилаб дуо қилганда муваккал фаришта: “Омийн! Сенга ҳам ўшандоқ бўлсин!” дейди” дер эдилар” деди.\n" +
                        "\n" +
                        "Имом Муслим ривояти."
            ),
            PrayerText(
                112,
                5,
                "Дуоси мустажоб кишилар",
                "\n" +
                        "عَنْ أَبِي هُرَيْرَةَ رَضِي اللهُ عَنْهُ، عَنِ النَّبِيِّ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ قَالَ: ثَلَاثُ دَعَوَاتٍ مُسْتَجَابَاتٌ لَا شَكَّ فِيهِنَّ: دَعْوَةُ الْوَالِدِ، وَدَعْوَةُ الْمُسَافِرِ، وَدَعْوَةُ الْمَظْلُومِ. رَوَاهُ أَبُو دَاوُدَ وَأَحْمَدُ وَالتِّرْمِذِيُّ\n" +
                        "\n" +
                        "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади: \n" +
                        "«Набий соллАллоҳу алайҳи васаллам: \n" +
                        "«Уч дуо мустажобдир. Уларда шак йўқ. Ота-онанинг дуоси, мусофирнинг дуоси ва мазлумнинг дуоси», дедилар».\n" +
                        "Абу Довуд, Аҳмад ва Термизий ривоят қилганлар.\n" +
                        "\n" +
                        "Шарҳ: Демак, ушбу уч тоифанинг яхши дуосини олишга ва ёмон дуосидан қўрқишга ўтиш керак.\n" +
                        "\n" +
                        "1. Ота-онанинг дуосини олиб, қарғишидан эҳтиёт бўлиш ҳар бир фарзанд учун ўта муҳимдир. Бу маъно бошқа жойларда батафсил баён қилинган.\n" +
                        "\n" +
                        "2. Мусофир одам ҳам ўзининг сафардаги ҳолати ила Аллоҳ таолога яқин бир вазиятга ўтиб қолади. Шунинг учун унинг дуоси ҳам қабул бўлади.\n" +
                        "\n" +
                        "3. Мазлум одам зулм туфайли Аллоҳ таолога илтижоси кучайиб, дуоси мақбул бўладиган бўлиб қолади.\n" +
                        "\n" +
                        "“Ҳадис ва Ҳаёт” китоби"
            ),
            PrayerText(
                113,
                5,
                "Ҳар бир нарсани Аллоҳдан сўранг",
                "عَنْ النعمان بن بشير رضي الله عنهما أن رسولَ الله صلى الله عليه وسلم قال: «الدعاء هو العبادة» ثم قرأ {وقال ربُّكمُ ادْعُونِي أسْتَجِبْ لَكُمْ ، إنَّ الّذِينَ يَسْتَكْبِرُونَ عن عِبَادَتِي سَيَدْخُلُونَ جَهَنَّمَ دَاخِرِينَ} غافر:الآية 60 أخرجه الترمذي \n" +
                        "\n" +
                        "Нуъмон ибн Башийр розияллоҳу анҳумодан ривоят қилинади:\n" +
                        "“Набий соллаллоҳу алайҳим васаллам:\n" +
                        "“Дуо ибодатдир”, дедилар ва “Роббингиз: “Менга дуо қилинг сизни ижобат қилурман. Албатта, Менинг ибодатимда кибр қилганлар жаҳаннамга хору зор ҳолларида кирурлар”ни қироат қилдилар” \n" +
                        "\n" +
                        "Термизий ривояти.\n" +
                        "\n" +
                        "Аллоҳ таоло Қуръони каримда ваъда қилади: “Менга дуо қилинг сизга ижобат қилурман”(Ғофир 60 оят). \n" +
                        "Аллоҳ таолонинг бу ваъдасида хато бўлиши мумкин эмас. Шу боис чин дилдан дуо қилиш лозим ва у албатта мақбул бўлади. Дуоларнинг қабул бўлиш сурати турли хилдир. Баъзи вақтларда ўша сўраган нарсаси берилади. Ва баъзи вақтларда у нарса Аллоҳ таолонинг илмида банда учун муносиб ёки фойда берувчи бўлмайди. Бас, Аллоҳ таоло ундан яхши ва фойдали нарсани дунё ёки охиратда ато қилади. Шу тарзда ҳар дуонинг уч фойдаси бор:\n" +
                        "\n" +
                        "1. Дуо қабул бўлиши билан мурод ҳосил бўлади;\n" +
                        "2. Ҳар дуога савоб етади;\n" +
                        "3. Дуо қанча кўп қилинса, шунча Аллоҳ таоло билан алоқа ортиб боради.\n" +
                        "\n" +
                        "Дуо қилувчининг одобига қиблага юзланиш, қўлни кўтариш, тил билан қилиш ва энг биринчи ҳамду сано ва дуруду шариф ўқиш кирсада, агар уни ўрни бўлмаса, бас усиз ҳам дуо қилиш жоиздир. Шунинг учун Аллоҳ таоло дуони шундай осон қилдики, тақрибан ҳар вақт ва ҳар жойда юриб, айланиб ва ишлаб туриб ҳам сўраш мумкин бўлади. Агар тил билан сўраш ўрни бўлмаса (масалан, ҳожатхонада ёки бошқа жойда), бас қалбдан сўраш ҳам мумкин бўлади.\n" +
                        "Дуода катта-катта нарсаларни сўраш зарур эмас, балки ўзининг катта, кичик ҳожатларини Аллоҳ таолодан сўраши лозим. Бу шу даражадаки, ҳадисларда келишича, оёқ кийимнинг тасмаси узилса ҳам, бас Аллоҳ таолодан сўранглар \n" +
                        "\n" +
                        "Термизий ривояти.\n" +
                        "\n" +
                        "Шу боис бу гапни одатга айлантириш лозимки, қачон жуда кичик ҳожатга рўбарў келса, уни Аллоҳ таолодан сўрасин. Арзимаган бирор машаққат бўлса, уни кетказишни ҳам Аллоҳ таолодан сўралади. Шу тарздаки, болага қачон бир муаммо рўбарў келса ёки бирор кичик машаққат етса, у ўз онасини чақиргани каби инсонга ҳам бирор ташвиш келса, Аллоҳ таолони чақириши лозим бўлади. Айланиб, юриб, туриб, ўтириб ва иш қилиб ва ҳар вақт кичикдан кичик нарсаларни Аллоҳ таолодан сўрашни одатга айлантирса, Аллоҳ \n" +
                        "хоҳласа жуда тез тараққий топади."
            ),
            PrayerText(
                114,
                5,
                "Ўзбек тилида дуолар",
                "Эй Аллоҳ, ризқимизни ҳалол, насибамизни тўла ва баркали этиб, биздан рози бўлиб турганингда жонимизни олгин! Эй Аллоҳ, мени жаҳаннам оташидан асрагин!\n" +
                        "\n" +
                        "Эй Роббим, кимнинг қалбида бизга нисбатан ёмонлик бўлса, ундай кимсаларни тушимизда ҳам, ўнгимизда ҳам бизга яқинлаштирмагин! Уларни биздан узоқ қилгин! Эй Роббим, жинлардан ва инсонлардан бўлган шайтонлардан бизни асрагин, омин!\n" +
                        "\n" +
                        "Ё Раб, Ўзингнинг ва Расулингнинг муҳаббатидан маҳрум қолдирмагин, севган қулларинг билан бирга сақлагин, севган йўлларингда юритгин, севган амалларингни бажартиргин, ҳузуринга Ўзинг севган ва Ўзинг рози бўлган бандаларинг бўлиб бормоғимизни насиб айлагин, омин!\n" +
                        "\n" +
                        "Аллоҳим ожизликдан, дангасаликдан, қалб қасоватидан, ғафлатдан, фақирликдан, хорликдан, мискинликдан, фисқдан, ҳаққа зид чиқишдан, хўжа кўрсиндан, карлик, соқовликдан, мажнунлик, пес, мохов ва оғир дардлардан панох сўрайман!\n" +
                        "\n" +
                        "Эй Аллоҳ!  Эй қийинчиликни енгиллаш-\n" +
                        "тирувчи Зот! Эй темирни юмшатувчи Зот! \n" +
                        "Эй ваъдани тезлатувчи Зот! Эй ҳар куни янги иш фаолиятдаги Зот! Мени танглик ҳалқаларидан энг кенг йўлга чиқаргин! Қийин ишни Сенинг ёрдаминг билангина бажараман. Куч ва қувват Олий, Буюк Аллоҳдадир! \n" +
                        "\n" +
                        "Эй Роббим! Дуоимни тўсилиб қолишдан асра! Сўровимни рад этма! Мени ҳасратим ила қолдирма! Мени ўз ҳолимга ташлаб қўйма! Ожизлигимга раҳм қил! Дилим тору танг, фикрим тарқоқ бўлиб, нима қиларимни билмай қолдим. Сен Поксан. Сен менинг сиримни ҳам, ошкоримни ҳам Билувчисан. \n" +
                        "Сен менинг фойдамга ҳам, зараримга ҳам Моликсан. Сен менинг мушкулимни аритишга, машаққатимни осонлаштиришга қодирсан.\n" +
                        "\n" +
                        "Эй Роббим! Ота-онам учун жаннат тўшакларидан насиб этгин! Ота-онамга Жаннат аҳлининг зийнатли либосларидан кийдиргин! Ота-онамга Жаннат таомларидан едиргин! Ота-онамга Жаннат шаробларидан ичиргин! Ота-онамни Жаннатда севикли Пайғамбаримиз Муҳаммад соллаллоҳу алайҳи васалламга ҳамроҳ қилгин!Ота-онамни Жаннат аҳлининг саййид ва саййидаларидан айлагин! Ота-онамга Жаннатнинг саккиз эшикларини очгин!\n" +
                        "Омин!"
            ),
            PrayerText(
                115,
                5,
                "Ҳамиша ўқиб юриладиган дуолар",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васалламнинг кўп (қилиб юрадиган) дуолари\n" +
                        "\n" +
                        "اللَّهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\n" +
                        "\n" +
                        "«Аллоҳумма атина фид-дуня ҳасанатав вафил ахирати ҳасанатав вақина ъазабан-нар» эди. \n" +
                        "(Маъноси: Парвардигоро, бизга бу дунёда ҳам яхшилик ато қил, охиратда ҳам яхшилик ато эт ва бизни дзах азобидан асра.)\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари.\n" +
                        "\n" +
                        "Ибн Масъуд розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам:\n" +
                        "\n" +
                        "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالعَفَافَ وَالغِنَى\n" +
                        "\n" +
                        "«Аллоҳумма инний ас‘алукал ҳуда ваттуқо вал ъафофа вал ғина», деб айтардилар \n" +
                        "(Маъноси: Аллоҳим, Сендан ҳидоят, тақво, иффат ва бойлик сўрайман.)\n" +
                        "\n" +
                        "Имом Муслим ривоятлари.\n" +
                        "\n" +
                        "Абдуллоҳ ибн Амр ибн Осс розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам\n" +
                        "\n" +
                        "اللَّهُمَّ يَا مُصَرِّفَ القُلُوبِ صَرِّفْ قُلُوبَنَا عَلَى طَاعَتِكَ\n" +
                        "\n" +
                        "«Аллоҳумма йа мусаррифал қулуб сарриф қулубана ъала тоъатика», деб айтардилар.\n" +
                        "(Маъноси: Эй қалбларни буриб қўювчи Аллоҳим, қалбимизни тоатингга буриб қўйгин.)\n" +
                        "\n" +
                        "Имом Муслим ривоятлари.\n" +
                        "\n" +
                        "Абдуллоҳ ибн Амр ибн Осс розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Абу Бакр Сиддиқ розияллоҳу анҳу Расулуллоҳ соллаллоҳу алайҳи васалламга «Менга бир дуо ўргатингки, у билан намозимда илтижо қилайин», деганларида, Расулуллоҳ соллаллоҳу алайҳи васаллам:\n" +
                        " \n" +
                        "اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْمًا كَثِيْرًا وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيْمُ\n" +
                        "\n" +
                        "«Аллоҳумма инний золамту нафсий зулман касийрон вала яғфируз зунуба илла анта фағфирлий мағфиратан мин ъиндика, варҳамний иннака антал ғофурур роҳийм», деб айт, дедилар.\n" +
                        "(Маъноси: Аллоҳим, мен нафсимга кўп зулм қилдим. Гуноҳларни Сендан бошқаси кечира олмайди. Ўзингнинг ҳузурингдан бўлган мағфират ила мени кечиргин. Ва менга раҳм қилгин, албатта Сен кечиргувчи, раҳмли Зотсан).\n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари.\n" +
                        "\n" +
                        "Саъд ибн Абу Ваққос розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васалламнинг ҳузурларига бир аъробий келиб, «Эй Аллоҳнинг расули, менга бир калом ўргатингки, уни айтиб юрайин», деганда, у зот:\n" +
                        " \n" +
                        "لاَ إِلَهَ إِلاَّ اللهُ وَحْدَهُ لاَ شَرِيْكَ لَهُ اللهُ اكْبَرُ كَبِيْرًا وَالْحَمْدُ للهِ كَثِيْرًا سُبْحَانَ اللهِ رَبِّ العَالَمِيْنَ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللهِ العَزِيْزِ الْحَكِيمِ\n" +
                        "\n" +
                        "«Ла илаҳа иллаллоҳу ваҳдаҳу ла шарийка лаҳу, Аллоҳу Акбар кабийрон валҳамду лиллаҳи касийрон субҳаналлоҳи роббил оламийна, ла ҳавла вала қуввата илла биллаҳил азизил ҳаким».\n" +
                        "(Маъноси: Якка Аллоҳдан бошқа илоҳ йўқ. Унинг шериги ҳам йўқ. Аллоҳ улуғларнинг улуғидир. Аллоҳга кўп ҳамд бўлсин. Оламлар Рабби Аллоҳни поклаб ёд этурман. Ҳаким, Азиз сифатли Аллоҳдан бошқа бирор ўзгартирувчи ҳам, қувват ҳам йўқ), деб айт, дедилар. Аъробий: «Булар Раббим учундир. Мен учун эса нима?» деганда, Расулуллоҳ соллаллоҳу алайҳи васаллам\n" +
                        "\n" +
                        "اللَّهُمَّ اغْفِرْ لِي وَارْحَمْنِي وَاهْدِنِي وَارْزُقْنِي وَعَافِنِي\n" +
                        "\n" +
                        "«Аллоҳумма иғфир лий варҳамний ваҳдиний варзуқний ва ъофиний», деб айт, дедилар. \n" +
                        "(Маъноси: Аллоҳим, мени мағфират қил, менга раҳм қил, мени ҳидоят эт, мени ризқлантир ва офиятда қил.)\n" +
                        "\n" +
                        "Имом Муслим ривоятлари.\n" +
                        "\n" +
                        "Оиша розияллоҳу анҳодан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам мана бу калималар билан дуо қилардилар: \n" +
                        "\n" +
                        "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ فِتْنَةِ النَّارِ وَعَذَابِ النَّارِ وَمِنْ شَرِّ الغِنَى وَالفَقْرِ\n" +
                        "\n" +
                        "«Аллоҳумма инний аъузу бика мин фитнатин нари ва ъазобиннар ва мин шаррил ғина вал фақри». \n" +
                        "(Маъноси: Аллоҳим, дўзах фитнасидан, дўзах азобидан, бойлик ва камбағаллик ёмонликларидан Сенинг номинг ила паноҳ тилайман.) \n" +
                        "\n" +
                        "Абу Довуд, Термизий, Насаий ва Ибн Можалар саҳиҳ иснод билан ривоят қилишган.\n" +
                        "\n" +
                        "Шаҳр ибн Ҳувшаб розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Бу зот Умму Салама розияллоҳу анҳуга: «Эй мўминлар онаси, Расулуллоҳ соллаллоҳу алайҳи васаллам сизнинг ҳузурингизда бўлганларида энг кўп қиладиган дуолари қайси эди?» деганларида, Умму Салама розияллоҳу анҳу: «Кўп дуолари\n" +
                        "\n" +
                        "يَا مُقَلِّبَ القُلُوبِ ثَبِّتْ قَلْبِي عَلَى دِيْنِكَ«Йа муқаллибал қулуб саббит қолбий ъала дийник» эди», дедилар.\n" +
                        "(Маъноси: Эй қалбларни ўзгартирувчи, қалбимни динингда собит қил.)\n" +
                        "\n" +
                        "Имом Термизий ривоятлари.\n" +
                        "\n" +
                        "Саъд ибн Абу Ваққос розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Катта балиқнинг қорнида Раббиларига илтижо қилган Зиннуннинг (Юнус алайҳиссалом) дуолари \n" +
                        "\n" +
                        "لاَ إِلَهَ إِلاَّ أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِيْنَ\n" +
                        "\n" +
                        "«Ла илаҳа илла анта субҳанака инний кунту миназ золимийн», эди. Бирор мусулмон киши мана шу калималар ила дуо қилса, ижобат этилади», дедилар.\n" +
                        "(Маъноси: Сендан бошқа илоҳ йўқ. Сени поклаб ёд этурман. Албатта мен золимлардан бўлдим.)\n" +
                        "\n" +
                        "Имом Термизий ривояти."
            ),
            PrayerText(
                116,
                5,
                "40 – Роббана дуолари.",
                "1. Роббанаа тақоббал минна иннака антас Самиъюл Алийм.\n" +
                        "(Роббимиз, биздан қабул эт, албатта, Сен Ўзинг ўта эшитувчисан ва\n" +
                        "ўта билувчисан).\n" +
                        "\n" +
                        "2. Роббанаа ва жаъална муслимайни лака ва мин зурриятина умматан\n" +
                        "муслиматан лака ва арина манасикана ва туб алайна иннака антат\n" +
                        "таввабу Раҳийм. (Роббимиз, иккимизни Ўзингга мусулмон\n" +
                        "бўлганлардан қил ва зурриётимиздан ҳам Ўзингга мусулмон уммат\n" +
                        "қил, бизга ибодатларимизни кўрсат, тавбамизни қабул эт. Албатта,\n" +
                        "Сен Ўзинг тавбани кўплаб қабул қилувчисан, ўта раҳмлисан).\n" +
                        "\n" +
                        "3. Роббанаа атина фиддуня ҳасанатан вафил ахирати ҳасанатан ва\n" +
                        "қина ъазабан нар. (Парвардигоро, бизга бу дунёда ҳам яхшилик ато\n" +
                        "қилгин, охиратда ҳам яхшилик ато этгин ва бизни дўзах азобидан\n" +
                        "асрагин).\n" +
                        "\n" +
                        "4. Раббана африг алайна собраан ва фаббит ақдамана вансурна алал\n" +
                        "қовмил кафирин. (Роббимиз, устимиздан сабр тўккин,\n" +
                        "қадамларимизни собит қилгин ва кофир қавмлар устидан бизга\n" +
                        "нусрат бергин).\n" +
                        "\n" +
                        "5. Роббанаа лаа туаҳизнаа ин насийна ав аҳтаана. (Роббимиз, агар\n" +
                        "унутсак ёки хато қилсак, (иқобга) тутмагин).\n" +
                        "\n" +
                        "6. Роббана вала тахмил ъалайна исрон кама хамалтаху ъалал-лазийна\n" +
                        "мин коблина. (Роббимиз, биздан олдингиларга юклаганинг каби\n" +
                        "оғирликни бизга юкламагин).\n" +
                        "\n" +
                        "7. Роббана вала тухаммилна ма ла токата лана бих. Ваъфу ъанна,\n" +
                        "вагфир лана, вархамна. Анта Мавлана фансурна ъалал ковмл\n" +
                        "кафирийн. (Роббимиз, Бизни афв эт, мағфират қил ва бизга раҳм\n" +
                        "айла. Сен Хожамизсан. Бас, кофир қавмлар устидан бизга нусрат\n" +
                        "бер).\n" +
                        "\n" +
                        "8. Роббанаа лаа тузиғ қулубанаа баъда из ҳадайтанаа ва ҳаб ланаа\n" +
                        "милладунка раҳматан иннака антал Ваххаб. (Роббимиз, бизни ҳидоят\n" +
                        "қилганингдан сўнг қалбларимизни оғдирмагин ва бизга Ўз\n" +
                        "ҳузурингдан раҳмат ҳадя этгин. Албатта, Сен Ўзинг кўплаб ҳадя\n" +
                        "этувчисан).\n" +
                        "\n" +
                        "9. Роббана иннака жамиъуннаси ли-Явмил лаа ройиба фиҳи\n" +
                        "инналлаҳа лаа юхлифул миъад. (Роббимиз, албатта, Сен одамларни\n" +
                        "ҳақида ҳеч шубҳа йўқ Кунда йиғувчисан. Албатта, Аллоҳ ваъдага\n" +
                        "хилоф қилмас).\n" +
                        "\n" +
                        "10. Роббана иннана аманна, фағфир лана, зунуубанаа ва қинна ъзабан\n" +
                        "нар. (Роббимиз, албатта, биз иймон келтирдик, бизнинг\n" +
                        "гуноҳларимизни мағфират қилгин ва олов азобидан сақлагин).\n" +
                        "\n" +
                        "11. Роббанааа амаанна бима анзалта ваттабаа нар-Расула фактубнаа\n" +
                        "маъаш шахидийн. (Роббимиз! Сен нозил қилган нарсага иймон\n" +
                        "келтирдик ва расулга эргашдик. Бас, бизни гувоҳлик берувчилар\n" +
                        "қаторига ёзгин).\n" +
                        "\n" +
                        "12. Роббанаағфир ланаа зунуубана ва исрофана фи амринаа ва таббит\n" +
                        "ақдамана вансурна ъалал қовмил кафирин. (Роббимиз!\n" +
                        "Гуноҳларимиз ва ишимизда ҳаддан ошганимизни мағфират қилгин,\n" +
                        "қадамларимизни собит қилгин ва кофир қавмлар устидан бизга\n" +
                        "нусрат бергин).\n" +
                        "\n" +
                        "13. Роббанаа ма холақта ҳазаа батилаа Субҳанака фақина ъзабан-нар.\n" +
                        "(Роббимиз, буни бекорга яратганинг йўқ, Ўзинг поксан, бизни олов\n" +
                        "азобидан сақлагин).\n" +
                        "\n" +
                        "14. Роббанаа иннака ман тудхилин нара фақад ахзайтаҳ ваа маа\n" +
                        "лиззоолимиинаа мин ансар. (Роббимиз, албатта, Сен кимни оловга\n" +
                        "киритсанг, батаҳқиқ, уни шарманда қилибсан).\n" +
                        "\n" +
                        "15. Роббанаа иннана самиъна мунаадиян юнадий лил иймаани ан\n" +
                        "аминуу би Роббикум фаъаманна. (Роббимиз, биз «Роббингизга\n" +
                        "иймон келтиринг!» деб иймонга чорлаётган нидо қилувчини\n" +
                        "эшитдик ва иймон келтирдик).\n" +
                        "\n" +
                        "16. Роббанаа фағфир лана зунуубанаа ва каффиръана сайиъааттинаа\n" +
                        "ва таваффана маъал Аброр. (Роббимиз, бизни мағфират қилгин ва\n" +
                        "ёмонликларимизни ўчиргин ҳамда аброрлар билан бирга ўлдиргин).\n" +
                        "\n" +
                        "17. Роббанаа ваъатина ма ваъадтана ъала русулика ва лаа тухзина\n" +
                        "явмал-Қиямаҳ. Иннака лаа тухлифул миъаад. (Роббимиз, бизга\n" +
                        "расулларингга ваъда қилган нарсаларингни бергин ва бизни қиёмат\n" +
                        "куни шарманда қилмагин. Албатта, Сен ваъдага хилоф қилмассан).\n" +
                        "\n" +
                        "18. Роббанаа аманна фактубна маъаш-шаҳидийн. (Роббимиз, иймон\n" +
                        "келтирдик, бас, бизни гувоҳлик берувчилар қаторига ёзгин).\n" +
                        "\n" +
                        "19. Роббанаа анзил ъалайна маааъидатам минас самаи такуна лана\n" +
                        "ъидаллии аввалина ва аахирина ва аяаатам минка варзуқна ва анта\n" +
                        "Хойрул-Розиқин. (Роббимиз! Бизга осмондан ясатилган дастурхон\n" +
                        "туширгинки, аввалимизгаю охиримизга байрам ва Сендан мўъжизабўлиб қолсин. Ва бизни ризқлантиргин, зотан, Ўзинг энг яхши\n" +
                        "ризқлантирувчисан).\n" +
                        "\n" +
                        "20. Роббанаа золамна анфусана ва лии лам тағфир лана ва тарҳамна\n" +
                        "ланакунна минал хоосирийн. (Роббимиз, ўзимизга зулм қилдик. Агар\n" +
                        "бизни мағфират қилмасанг ва бизга раҳм қилмасанг, албатта, зиён\n" +
                        "кўрувчилардан бўламиз).\n" +
                        "\n" +
                        "21. Роббанаа лаа тажъална маъал қоввмии золимийн. (Роббимиз,\n" +
                        "бизни золим қавмлар билан бирга қилмагин).\n" +
                        "\n" +
                        "22. Роббана афтаҳ байнана ва байна қовминаа бил ҳаққи ва анта\n" +
                        "Хойрул Фатиҳиийн. (Роббимиз! Биз билан қавмимиз ўртасини ҳақ\n" +
                        "ила очгин. Сен очувчиларнинг яхшисидирсан).\n" +
                        "\n" +
                        "23. Роббанаа африғ ъалайна собров ва таваффана мислимийн.\n" +
                        "(Роббимиз, устимиздан сабр тўккин ва мусулмон ҳолимизда вафот\n" +
                        "эттиргин).\n" +
                        "\n" +
                        "24. Роббанаа лаа тажъална фитнатал лил қовмии золимийн. Ваа\n" +
                        "нажжина би Роҳматика минал қовмил кафирийн. (Роббимиз, бизнизолим қавмларга фитна қилиб қўйма. Ва Ўз раҳматинг ила бизга\n" +
                        "кофир қавмлардан нажот бергин).\n" +
                        "\n" +
                        "25. Роббанаа иннака таъламуу маа нухфии ва маа нууълиин. Ва маа\n" +
                        "яхфаа ъалаллооҳи мин шаииъийн фиил арди ваа лаа фис самааа.\n" +
                        "(Роббимиз! Албатта, Сен махфий тутган нарсамизни ҳам, ошкор\n" +
                        "қилган нарсамизни ҳам яхши билурсан. Албатта, Аллоҳ Унга на ерда\n" +
                        "ва на осмонда бирор нарса махфий қолмайдиган Зотдир).\n" +
                        "\n" +
                        "26. Роббанаа ваа тақоббал дуааа. (Эй Роббимиз, дуони қабул этгин).\n" +
                        "\n" +
                        "27. Роббанаа иғфирлиий ваа лии валлидаййа ваа лил муъминина\n" +
                        "явмаа яқумул ҳисааб. (Эй Роббимиз, мени, ота-онамни ва\n" +
                        "мўминларни ҳисоб қилинадиган куни мағфират айлагин).\n" +
                        "\n" +
                        "28. Роббанаа ъатинаа милладункаа Роҳматав ва ҳаййи ланаа мин\n" +
                        "амрина рошадаа. (Эй Роббимиз, бизга Ўз ҳузурингдан раҳмат бергин\n" +
                        "ва ишимизни ўзинг тўғрилагин).\n" +
                        "\n" +
                        "29. Роббанаа иннана нахофуу айййафрутаа ъалайна ав аййотғаа. (Эй\n" +
                        "Роббимиз, биз унинг тезда бизга ёмонлик қилишидан ёки ҳаддан\n" +
                        "ошишидан қўрқамиз).\n" +
                        "\n" +
                        "30. Роббанаа аманна фағфир ланаа варҳамнаа ва анта хойруур\n" +
                        "Роҳимийн. (Эй Роббимиз, Биз иймон келтирдик. Бизни мағфират\n" +
                        "қилгин. Бизга раҳм қилгин. Сенинг Ўзинг раҳм қилгувчиларнинг\n" +
                        "яхшисисан).\n" +
                        "\n" +
                        "31. Роббанаа асриф анна ъазабаа жаҳаннама инна ъазабаҳа кана\n" +
                        "ғоромаа. Иннаҳа саъат муста қорров ва муқомаа. (Эй Роббимиз,\n" +
                        "Ўзинг биздан жаҳаннам азобини бургин, албатта, жаҳаннам азоби\n" +
                        "доимийдир. Албатта, у энг ёмон қароргоҳ ва турар жойдир).\n" +
                        "\n" +
                        "32. Роббанаа ҳабланаа мин азваажина ваа зуриятийна, қуррота\n" +
                        "ъайиони ва жаална лил муттақиийна имама. (Эй Роббимиз, Ўзинг\n" +
                        "бизга жуфти ҳалолларимиздан ва зурриётларимиздан кўзимиз\n" +
                        "қувонадиган нарса ҳадя эт ҳамда бизларни тақводорларга йўлбошчи\n" +
                        "эт).\n" +
                        "\n" +
                        "33. Роббанаа лаа Ғофурун шакур. (Роббимиз ўта мағфиратли ва ўта\n" +
                        "шукр қилгувчидир).\n" +
                        "\n" +
                        "34. Роббанаа васиъта кулла шаъйин Роҳматан ваа ъилман фағфир\n" +
                        "лиллазийна табуу ваттабаъу сабилака вақиҳим ъазаабал Жаҳийм. (ЭйРоббимиз, раҳматинг ва илминг ила ҳар бир нарсани қуршагансан,\n" +
                        "бас, тавба қилиб, йўлингга эргашганларни мағфират қилгин ва\n" +
                        "уларни дўзах азобидан сақлагин).\n" +
                        "\n" +
                        "35. Роббанаа ваа адхиҳум жаннатии ъадниниллати ваъаттаҳум ваа\n" +
                        "ман солаҳа мин абаъйиҳим ваа азваажиҳийм ваа зурийятиҳим иннака\n" +
                        "антал Азизул Ҳаким. Ваақиҳимус саийиъат ваа ман тақис саийиъати\n" +
                        "явмааъизин фақод роҳимтаҳ ва залиика ҳувал фавзул Азийм. (Эй\n" +
                        "Роббимиз, уларни ҳам, оталаридан, жуфтларидан ва\n" +
                        "зурриётларидан аҳли солиҳ бўлганларини ҳам Ўзинг уларга ваъда\n" +
                        "қилган адн жаннатларига киритгин. Албатта, Сенинг Ўзинг азизу ўта\n" +
                        "ҳикматли зотсан. Ва уларни ёмонликлардан сақла, ўша куни кимни\n" +
                        "ёмонликлардан сақласанг, батаҳқиқ, унга раҳм қилибсан. Ана ўша\n" +
                        "буюк ютуқдир).\n" +
                        "\n" +
                        "36. Роббанағфирлана ва ли ихвааниналлазийна сабақуунаа бил\n" +
                        "иймаани ва лаа тажъал фий қулуубинаа ғиллал лиллазийна амануу.\n" +
                        "(Роббимиз, бизни ва биздан аввал иймон билан ўтган\n" +
                        "биродарларимизни мағфират қилгин, иймон келтирганларга\n" +
                        "нисбатан қалбимизда ғашлик қилмагин).\n" +
                        "\n" +
                        "37. Роббанаа иннака роууфур роҳийм. (Роббимиз, албатта, Сен ўта\n" +
                        "шафқатлисан, ўта раҳмлисан).\n" +
                        "\n" +
                        "38. Роббанаа ъалайка таваккална ва илайка анабна ва илайкал\n" +
                        "масийр. (Роббимиз, Сенгагина таваккул қилдик, Сенгагина тавбалар\n" +
                        "қилдик ва қайтиб бориш фақат Сенгадир).\n" +
                        "\n" +
                        "39. Роббанаа лаа тажъална фитнатал лиллазийна кафару вағфирлана\n" +
                        "роббана. (Роббимиз, бизни кофирлар учун фитна қилиб қўймагин ва\n" +
                        "бизни мағфират қил. Роббимиз, албатта, Сен Ўзинг ўта иззатлисан,\n" +
                        "ўта ҳикматлисан).\n" +
                        "\n" +
                        "40. Роббанаа атмимлана нурона вағфирлана иннака ъала кулли\n" +
                        "шай°ин қодийр. (Роббимиз, бизга нуримизни батамом қилиб бер,\n" +
                        "гуноҳларимизни мағфират қил, албатта, Сен ҳар бир нарсага ўта\n" +
                        "қодирсан)."
            ),
            PrayerText(
                117,
                5,
                "Бирор киши билан кўришганда",
                "Анас розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам бирор кишининг қўлини ушласалар,\n" +
                        "\n" +
                        "اللهُمَّ آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ\n" +
                        "\n" +
                        "«Аллоҳумма атина фид-дуня ҳасанатан ва фил ахироти ҳасанатан вақина азабан-нар», деб айтмасдан ажралмасдилар. \n" +
                        "\n" +
                        "Ибн Сунний ривоятлари."
            ),
            PrayerText(
                118,
                5,
                "Акса урганга жавоб беришда",
                "Абу Ҳурайра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам: «Сизлардан бирингиз акса берса, \n" +
                        "\n" +
                        "الْحَمْدُ للهِ\n" +
                        "\n" +
                        "«Алҳамдулиллаҳ», десин. Ёнидаги оғайниси ёки дўсти \n" +
                        "\n" +
                        "يَرْحَمُكَ اللهُ\n" +
                        "\n" +
                        "«Ярҳамукаллоҳ», десин. \n" +
                        "«Ярҳамукаллоҳ», деган кишига\n" +
                        "\n" +
                        "يَهْدِيكُمُ اللهُ وَيُصْلِحْ بَالَكُمْ\n" +
                        "\n" +
                        "«Яҳдикумуллоҳу ва юслиҳ болакум», яъни «Аллоҳ сизни ҳидоят қилиб, шаънингизни ислоҳ этсин», десин», дедилар. \n" +
                        "\n" +
                        "Имом Бухорий ривоятлари."
            ),
            PrayerText(
                119,
                5,
                "Бирор киши бошқа кишини мақтаганда",
                "Абу Бакра розияллоҳу анҳудан ривоят қилинади:\n" +
                        "Расулуллоҳ соллаллоҳу алайҳи васаллам ҳузурларида бир киши зикр қилинди. Шунда бошқа бир киши унинг яхшилигини гапириб мақтаб юборди. Буни эшитган Расулуллоҳ соллаллоҳу алайҳи васаллам: «Дўстингнинг бўйнини синдирдинг-ку», деб бир неча марта айтдилар. Сўнгра у зот: «Агар сизлардан бирингиз мақташга мажбур бўлиб қолса, уни ундай-бундай ва шу сингари, деб ўйлайман, десин. Агар мен билганимдек ана шу сифатларга эга бўлса,\n" +
                        " \n" +
                        "حَسِيْبُهُ اللهُ وَلاَ يُزَكِّي عَلَى اللهِ أَحَدًا\n" +
                        "\n" +
                        "«Ҳасийбуҳу Аллоҳ вала юзаккий ъалаллоҳу аҳада»\n" +
                        "(Маъноси: «Унинг кифоячиси Аллоҳдир. Аллоҳнинг олдида бирор киши айбсиз эмас»), десин», дедилар. \n" +
                        "\n" +
                        "Имом Бухорий ва Муслим ривоятлари."
            ),

            )
    }

}